{"query": ["Tell me about Obama family tree.", "What is Fickle Creek Farm", "Tell me about sonoma county medical services.", "Tell me about of Ralph Owen Brester.", "I'm looking for information about mayo clinic Jacksonville FL", "How to prepare for the GMAT?", "I'd like to learn about lymphoma in dogs", "Is Kenmore heater good", "Tell me more about HP mini 2140", "Tell me about the pacific northwest laboratory.", "What is California Franchise Tax Board", "What are specific dangers of asbestos?", "How to write a thank you letter after an interview?", "how to hire disc jockey", "TV on computer", "Tell me more about Culpeper National Cemetry", "Tell me about Bowflex Power Pro.", "butter and margarine", "I'm looking for information on duchess county tourism", "Tell me information about Iowa's food stamp program", "map", "What is equal opportunity employer?", "I'm interested in mothers day songs", "Tell me about source of the nile", "Tell me about american military university.", "tell me about rock and gem shows", "I'm looking for information on jax chemical company", "I'm interested in dinosaurs", "Information about east ridge high school.", "How to register dmv in va?", "Tell me more on health clubs in Arkansas", "where can I buy a trombone?", "Tell me about vines for shade.", "What can I do in sherwood regional library", "tell me about tangible personal property tax", "What is martha stewart and imclone?", "Tell me about uplift at yellowstone national park", "Give me espn sports information.", "Tell me about Pocono", "figs", "I need information about the University of Phoenix.", "How should I use the septic system design", "Find information on Porterville.", "I'm looking for information about game and fish in Arizona.", "What are the best recepies for grilling", "Tell me more about dnr", "What to do in Arkansas", "Tell me about Barbados.", "What are the causes of lipoma tumors", "Find information on hip fractures", "What are signs of a heartattack?", "Tell me about weather stripping", "what is the best long term care insurance", "Tell me about black history.", "Tell me about hotels in New York.", "Tell me about kansas city mo", "How do I get my free annual credit report?", "tell me about UNC", "Tell me about vanuatu", "Tell me about Internet phone serices.", "Find information about the gs pay rate", "Take me to the current.", "Tell me information about a sore throat.", "tell me about idaho state flower", "Tell me more about indiana state fairgrounds.", "Tell me about fybromyalgia", "Find information on French Lick Resort and Casino.", "Tell me information about Volvo.", "I'm looking for information on Rick Warren.", "What is yahoo", "How can I lower my heart rate?", "I'm interested in InuYasha", "Tell me about ps 2 games?", "How to get organised?", "Find me information about diabetes education", "Find information about atari", "I'm looking for information on web design and hosting.", "Find information about elliptical trainer", "Tell me about cell phones.", "Which gps receiver I should buy", "How can I adopt a dog", "Give me information about Disneyland hotel.", "How to change the toilet in the house", "what are the popular jobs in Michigan", "I’m looking for the music man.", "Find information about the secret garden.", "Give me information about Alexian Brothers hospitals.", "tell me about wilson antenna", "I'm looking for flame designs", "Find information about Mitchell College.", "Info on dog heat?", "Tell me about avp", "discovery channel store", "I'm looking for information on the president of the united states", "tell me about iron", "tell me about uss yorktown charleston SC", "tell me about ct jobs", "Find information about penguins.", "how to build a fence?", "Tell me more on Kansas city railroad", "Tell me about Bellevue.", "I’m looking for information on worm", "Find information about flushing.", "Tell me about Korean language.", "I need information on income tax return online", "I'm looking for information on VLDL levels", "Find me information about PVC", "Find sewing instructions for me", "to be or not to be that is the question", "Find information about the sun.", "Tell me about Neil Young.", "Find information about tornadoes", "Information about bobcat", "I'm looking for keyboard reviews", "Tell me about Afganistan.", "I'd like to learn about joints", "what are continental plates", "Where can I find information about forearm pain?", "Give me information on OCD.", "I am looking for sources of used car parts.", "tell me about mgb", "Information about raffles", "tell me about rice?", "I'm looking for information about South Africa", "Find me information on sat", "Tell me more about satilies", "What is average charitable donation?", "What is Madagascar known for?", "Tell me about kids earth day activities", "What was electoral college 2008 results?", "What is USDA food pyramid", "Tell me about making chicken soup from scratch.", "i will survive lyrics", "Tell me more about Hawain volcanos", "what are the seven deadly sins", "I'm looking for information on hurricane Irene flooding in manville nj", "tell me about symptoms of mad cow disease in humans", "Let's see frank lloyd wright biography", "How to use wiki?", "Tell me about civil war battles in South Carolina", "How is identifying spider bites?", "tell me about evidence for evolution", "Give me information about tribe formerly living in alabama", "Find symptoms of heart attack", "How can I view my internet history?", "where to find morel mushrooms", "I'm looking for information on common schizophrenia drugs", "I'm looking for information on recycling lead acid batteries", "Where can I find cheap internet", "Tell me about madam cj walker", "Child support in Indiana?", "Tell me about the sit and reach test.", "What are characteristics of Uranus", "Tell me about electronic skeet shoot.", "How can one can become highway patrol", "What is a 403b?", "Find me information about the Last Supper painting.", "I'm looking for information on the beatles rock band", "Tell me about furniture for small spaces.", "I'm interested in poker tournaments", "Tell me about scooters.", "Tell me about ron howard.", "I'm looking for information on becoming a paralegal", "How to cook pork tenderlion", "I’m interested in old coins", "How can I quick smoking", "I’m interested in civil right movement", "Find condos in Florida.", "Tell me about designer dog breeds.", "Looking for information about the Orange County Convention Center", "Tell me more about USA tax for annuity", "Tell me about texas border patrol.", "I'd like to learn about moths", "Give me air travel information.", "Find information on raised gardens.", "I'm looking for information on dieting", "tell me about bart sf", "who invented music", "Tell me about er television show.", "Find information about the wall", "Give me information about Titan.", "Find me reviews of the les Miserables.", "tell me about dark chocolate health benefits", "Tell me bio of george bush sr.", "Tell me more about us presidents", "Tell me about folk remedies for a sore throat.", "How do you tie a Windsor knot?", "Find me information about the Ritz Carlton Lake Las Vegas.", "I'm looking for universal animal cuts reviews", "tell me about cass county missouri", "Tell about an adobe indian house?", "What is von Willebrand Disease?", "Tell me about atypical squamous cells", "all men are created equal", "Tell me more about Rocky Mountain News", "Find me information about the sales tax in Illinois.", "I'm looking for information on hobby stores", "I’m looking for blue throated hummingbird", "Tell me information about computer programming.", "What should I know about the civil war", "I want to learn about rock art.", "I'm looking for a wedding budget calculator", "Find Brooks Brothers clearance.", "When can I see Churchil Downs", "Where should I order dog clean-up bags", "Where can I buy pressure washers?", "Find information on ontario california airport.", "tell me about diversity", "Tell me more about Euclid", "Tell me about Starbucks.", "Find information on Hoboken", "Tell me about pampered chef", "Give me information on solar panels.", "Find information about living in India.", "Tell me about kiwi", "I want to know about appraisals.", "Find information from the milwaukee journal sentinel.", "What does the US capital gains tax rate consist of and how is it broken down?", "What was the name of Elvis Presley's home?", "Fine me beef stroganoff recipe", "What are problems with ford edge?", "Tell me about history of orcas island", "Find more information about baldness cure", "Find information on hayrides in pa", "What are treatments for carotid cavernous fistula?", "Tell me about the educational advantages of social networking sites.", "where to go if I made a crime in Brazil", "What is Poem in Your Pocket Day?", "Find me a map of the US Capitol", "How to cure angular cheilitis", "Tell me about defender", "Find me map of USA", "Tell me more about horse hooves", "tell me about Voyager", "tell me about memory", "Who is the patron saint of mental illness?", "i'm interested in history of the electronic medical record", "I would like to know more about raspberry pi", "Give me information on uss carl vinson.", "What is most importan rule of golf", "I'm looking for wind power", "Tell me about bph treatment", "tell me more about Doctor Zhivago", "I'm interested to know about land surveyor", "golf gps", "Tell me about home theater systems.", "I'm looking for information on carpal tunnel syndrome", "Info on maryland department of natural resources", "which are famous movies where Nicolas Cage appeared?", "Tell me information about solar water fountains.", "I'm interested in NBA records", "I'm looking for information on male menopause", "I'm looking for black and gold.", "Tell me about traverse city.", "tell me about world's biggest dog", "Tell me about hair dye.", "How do you get a ham radio license?", "Find me information about a lump in the throat.", "cannellini beans", "Find information about afghanistan flag", "old town scottsdale", "roosevelt island", "Tell me about rain main.", "What is the shelf life of an egg?", "What is an occupational therapist?", "What treatments are available for a tooth abscess?", "Tell me about barrett's esophagus", "Tell me about teddy bears.", "Find information about holes by louis sachar", "Find information on hip roof", "What is special about Carpenter bees?", "Tell me about american revolution.", "What were the worst tornadoes in the USA?", "What are the lyrics to feliz navidad?", "What are the benefits of running?", "Find information about marshall county schools.", "I'm interested in sun tzu", "Tell me about halloween activities for middle school", "How can I interpret my dreams", "Give me information on wilson's disease.", "Find information on golf instruction.", "Tell me about USS Cole.", "how has african american music influence history", "What is bewitched cast?", "Find information about mister rogers", "Tell me about game theory.", "What is a ketogenic diet?", "Tell me about nasa interplanetary missions", "I'm interested in magnesium rich foods", "I'm interested in Fidel Castro", "tell me about benefits of yoga", "Tell me about norway spruce.", "tell me about sangre de cristo mountains", "tell me more flowering plants", "Tell me about altitude sickness.", "I'm interested in the topic of medical care and jehovah's witnesses", "What is pink slime in ground beef", "How to compute the mean of a set of numbers"], "reference_clarification_questions": [["are you interested in seeing barack obamas family", "which specific details would you like to learn about obamas heritage", "are you looking for biological information on his family", "would you like to know who is currently alive from president obamas family tree", "how many generations would you like me to list from president obamas family tree", "are you referring to the time magazine essay", "what would you like to know about obamas heritage", "which family members of obama are you interested in learning more about", "would you like to know about obamas ancestors", "do you want to know more about obamas parents", "would you like to hear about president obamas family tree", "would you like to know barack obamas geneology"], ["do you want the history of fickle creek farm", "are you looking for specific information regarding fickle creek farm", "are you looking for information about staying at fickle creek farm", "do you want to know the location of fickle creek farm", "are you looking for a place which sales products from fickle creek farm", "are you going to purchase anything there", "do you want to know the animal population at fickle creek farm", "would you like to know where fickle creek farm is on a map"], ["do you need addresses", "are you looking for contact information", "are you interested in the human services department", "are you looking for specific program information", "do you need any specific information on health insurance", "how soon is this needed", "do you want information on the differenct services that are provided", "is this for an emergancy", "would you like the different services that are provided", "are you looking for employment with sonoma country medical", "is there a specific program you are looking for"], ["would you like to know what movie star portrayed brewster in the movie the aviator and what award the movie star was nominated for the performance", "may i provide you with information regarding when ralph owen brewster died and cause of death", "would you like to know what political party ralph owen brewster was affiliated with", "who is ralph owen brewster", "may i tell you about brewsters parents where and when he was born", "what is ralph owen brewser famous for", "what is ralph owen brewsters background", "would you like to know the political positions ralph owen brewster held", "are you interested in learning more about ralph owen brewseter", "what is ralph owen brewsters education", "would you like to know about brewsters college education degree and work history", "how old is ralph owen brewseter"], ["have you been to this clinic before", "would you like to know the phone number of mayo clinic jacksonville fl", "are you located in jacksonville fl", "which treatments are you looking for at mayo clinic jacksonville fl", "would you like to know the address of mayo clinic jacksonville fl", "is this an emergency", "which department are you interested in at mayo clinic jacksonville fl", "are you looking for a specific doctor at mayo clinic jacksonville fl", "what time are you wanting to visit this clinic", "are you wanting to visit this hospital because of a friend or family", "are you looking for outpatient services in mayo clinic", "is there a medical condition that you are looking heal", "are you interested in jobs at mayo clinic jacksonville fl", "would you like to know more about the mayo clinic facilities and services", "would you like to request an appointment"], ["are you looking for some sample tests", "are you looking for an online or inperson gmat prep class", "do you want to know a list of top gmat prep classes", "do you feel unprepared for the gmat test", "are you looking for reviews of gmat prep classes", "what score would you like to achieve on the gmat test", "would you like to know what distinguishes gmat from gre", "any specific company on your mind", "would you like to know more about the gmat test", "would you like to see the most effective methods of gmat prep", "are you looking for gmat prep classes near you", "would you like to see a price range for gmat prep classes", "are you looking for a specific web site", "when do you want to take a gmat prep class", "do you want to know the cost of a gmat prep class"], ["do you need help finding a vet that treats lymphoma in dogs", "do you want to know the cost of treatment", "are you interested in the treatment costs of lymphoma in dogs", "are you referring to lymphoma in the mouth", "which state of lymphoma in dogs are you referring to", "would you like to know about risk factors of lymphoma in dogs", "are you referring to lymphoma in the eyes", "are you looking for the symptoms of lymphoma in dogs", "do you want to know about the latest research in lymphoma in dogs", "do you want to know about the symptoms of lymphoma in dogs", "do you need information on the prognosis of lymphoma in dogs", "do you want to know the nearest vet that can help", "are you looking for treatment options"], ["what year model are you looking for", "would you like to know who carries this product", "are you iinterested in a kenmore gas water heater", "are you looking for a specific model or part", "are you looking for the instruction of the kenmore sears gas water heaters", "do you want to compare different models", "would you like to know the size of this product", "what size are you looking for", "would you like me to find the nearest kenmore store for you", "are you looking to purchase or repair a unit", "would you like reviews on the kenmore gas water heater", "are you troubleshooting or trying to repair the unit", "would you like to know how much a kenmore gas water heater is"], ["do you want reviews of the hp mini 2140", "are you trying to know the warranty period of hp mini 2140", "do you want to read reviews of hp mini 2140", "what type of problem are you having with the hp mini 2140", "do you need information on accessories for the hp mini 2140", "are you looking for the nearest store you can buy hp mini 2140", "do you want to know the price of hp mini 2140", "how do you intend to use hp mini 2140", "do you need technical specifications for the hp mini 2140", "do you want to know the specs of hp mini 2140", "do you want to buy a hp mini 2140", "do you want to download drivers for the hp mini 2140"], ["are you looking for a specific representative in relation to the company", "are you referring to the specific company", "are you looking for jobs in richland", "do you need information on employment opportunities", "do you need stock price values for the company", "are you looking for research papers", "are you looking for lab jobs", "is there a specific representative that you need contact information for", "do you need any specific information about pnl", "do you need the address or location for the company", "do you seek further information on lab breeders", "is there any specific information that you would like to know about employment requirements at pnl", "are you looking for a specific web site", "are you looking for any specific facilities", "are you referring to the lab in seattle"], ["are you looking for payment information", "do you want contact information for the board", "are you trying to login to the boards website", "do you want a phone number", "are you looking for legal forms", "do you want to know the address", "do you want information on the tax board", "do you wish to do an entity search", "do you need specific forms to fill out", "do you want to know their hours of operation"], ["would you like to know whether asbestos exposure cause cancer", "are you interested in asnestos exposure", "do you want to know whether living in a home with asbestos insulation can cause people to become sick", "what kind of information are you looking for news or research on the dangers of asbestos", "what exactly do you wanto to know about the dangers of asbestos", "would you like to know about the dangers of asbestos removal", "are you looking for some statistics regarding the exposure of asbestos", "are you referring of the dangers of asbestos in new or old houses", "would you like to know about health problems that arise from exposure to asbestos", "are you requesting information about the dangers of asbestos or the symptoms of associated with asbestos exposure", "are you interested in the levels of dangers associated with asbsestos", "are you asking about the dangers of asbestos siding", "do you have any type of asbestos in mind when you ask about the dangers of asbestos", "are you interested in learning about the symptoms associated with asbestos poisioning"], ["are you interested in example of thank you letters for interview", "would you like a list of common interview questions", "would you like to know more information about writing a thank you email", "are you preparing to conduct an interview or go to an interview", "are you interested in interview thank you letters", "do you want tips on how to be successful in an interview", "are you looking for an interview preparation guide", "do you want guidelines on how to ace an inteview", "do you like to know more about writing thank you notes for an interview", "what about an interview do you need help with", "are you interested in learning how to write a thank you letter after an interview", "would you like to know more about writing interview thank you letters"], ["are you looking to find a djs website", "is there a certain type of dj you are looking for", "are you looking for djs in your area", "do you need to book a dj for an event", "are you looking for djs", "do you want to go to a djs website", "do you want to know the price to hire a dj", "would you like to know how to become a dj", "are you a dj", "do you need recommendations for djs", "are you looking for different kinds of djs", "would you like to read about dj employment", "are you looking for reviews of djs"], ["do you want to find online tv streaming services", "do you want to know technical information about tv on computer", "which tv and computer information would you like to know more about", "do you want to know how to display your computer on a tv", "do you want to purchase streaming services", "are you looking for netflix", "are you interested in buying a tv with a computer included", "do you want to know what sites you can watch tv on the computer at", "would you like to know how to watch tv on your computer"], ["do you want to know the history of culpeper national cemetery", "are you looking for things to do near culpeper national cemetery", "would you like to know the way to culpeper national cemetary", "are you looking for the records for culpeper national cemetary", "would you like to know who are buried at culpeper national cemetery", "do you want to know the size of culpeper national cemetery", "would you like to see news about culpeper national cemetary", "what would you like to know about culpeper national cemetary", "do you need directions to culpeper national cemetery", "would you like to know the history of culpeper national cemetary", "would you like to see services for the culpeper national cemetary today", "do you want to visit culpeper national cemetery", "do you need the address of culpeper national cemetery"], ["do you want to know about reviews on the bowflex power pro", "do you want to buy some parts for this equipment", "are you interested in purchasing it online", "would you like to know the history of the bowflex power pro", "are you interested in where the bowflex power pro is produced", "would you like to learn more about how to exercise with the bowflex power pro", "would you like to see an instruction manual", "would you like to see some reviews", "are you wondering if there has been a recall notice", "do you want to know how to use the bowflex power pro", "would you like to see some different exercises which can be done with this equipment", "would you like to see specs on this equipment", "would you like to know where to buy one", "are you looking for any specific information on bowflex power pro"], ["are you looking to subsitute butter and margarine", "would you like to see recipes with butter and margarine", "are you looking to use butter and margarine in baking", "would you like to know how butter and margarine are used in recipes", "would you like to know about butter and margarine making process", "would you like to see how these fats effect human arteries", "would you like to know the differences between butter and margarine", "are you looking for butter and margarine comparison", "are you looking for health facts of butter and mararine", "would you like to know how butter and margarine affect the food you eat", "are you looking for the brands of butter and margarine", "are you interested in the the nutritional value of butter and margarine", "are you looking for the history of butter and margarine"], ["are you looking for information related to tourism", "are you interested in the farm fresh tours", "did you want to know about the dutchess county tourism center", "do you want a job in dutchess county", "are you looking for a job in dutchess county in regards to tourism", "what activities in dutchess county were you interested in", "are you seeking an event calendar for dutchess county", "do you want to move to dutchess county", "did you want to know the amount of tourism dutchess county gets", "what tourist spots are you looking for in dutchess county", "where in specific in dutchess county were you curious about"], ["are you looking for more information on food stamps in iowa", "would you like directions to the nearest iowa food stamp office", "are you referring to a federally funded food stamp program or one that is funded by the state government", "are you interested in how much you can get from this program", "are you interested in the requirements for applying to the program or the poverty level limits", "are you referring to a food stamp program that is current or a historical one", "regarding food stamps in iowa are you looking for eligibility information", "are you looking for an application on this topic", "do you need requirements for food stamps in iowa", "are you looking for a specific web site", "do you need to apply for food stamps in iowa", "would you like a website about this topic", "are you looking for requirements to become a food assistance"], ["are you on a road trip", "would you like to see google maps homepage", "do you have map apps on your phone", "are you looking for a world atlas", "would you like a map with services or sites of interest listed", "do you want a tourist map", "do you want a map of your local area", "are you traveling", "are you interested in satellite maps", "what place do you want a map of", "do you need traveling assistance or direction", "are you interested in cartography", "do you want a map with driving directions", "do you want themed maps", "do you study road maps"], ["what information would you like in regards to an equal opportunity employer", "do you want to know what being an equal opportunity employer means", "would you like to know if you are eligible for equal opportunity employment", "what do you need to know about equal opportunity employment", "are you looking for anything specific in terms of equal opportunity discrimination", "are you looking for a specific web page", "are you looking for specific information regarding an equal opportunity employer", "would you like to see the legal definition of equal opportunity employer", "would you like to know if your company adheres to equal opportunity employment", "would you like to know the history of the equal opportunity employer act", "would you like to see jobs around you that are equal opportunity employers", "would you like to know what the equal opportunity employer act is", "do you need information about a specific employer", "would you like to see how to meet the legal requirement to be an equal opportunity employer"], ["do you want songs that were released on mothers day in a specific year", "are you referring to the movie", "are you looking for a specific mothers day song", "do you have an artist that you want to hear in mothers day songs", "are you interested in remembrance songs", "are you looking for a playlist of mothers days songs", "are you looking for any specific lyrics", "is there a certain genre of music you prefer", "are you looking album called mothers days songs", "what mothers day song are you looking for", "are you looking for a particular artist", "is there a certain melody you are interested in", "would you like to know about specific artists related to mothers day", "are you wanting the titles of mothers day songs"], ["are you interested in the origin of the nile", "do you want to know the name of the source", "do you want to know what country the source is in", "are you referring to the nile river", "is there any specific information about the river that would interest you", "do you want a map", "which nile are you interested in learning about", "do you want a history of the nile", "do you want to know about the source of the video game", "which part of the river are you more interested in", "do you want to know where the nile is located", "would you like to know what the nile is composed of"], ["would you like to know more about its history", "do you want to know more about the the curriculum", "are you wanting information about west point", "are you looking for a specific web page", "what degree in particular would you like to know more about from the american military unviersity", "would you be interested in learning more about the history of the american military university", "would you like to read some reviews about american military university", "are you talking about the navel academy", "are you wanting to know more about the entrance requirements", "would you like to know how to get to the american military university", "were you interested in applying to the american military university or just recieving an informational brochure", "are you interested in learning more about tuition costs for the american military university", "are you wanting to know its location", "are you referring to the american military university as in the actual school"], ["are you curious about rock and gem shows", "would you like a list of rock and gem shows in 2019", "are you looking for information about upcoming rock and gem shows", "what kind of information do you need about rock and gem shows", "would you like a list of rock and gem shows in 2018", "would you like to learn about rock and gem shows in california", "what would you like to know about rock and gem shows", "do you want to see the nearest rock and gem shows", "would you like directions to local rock and gem shows", "would you like to learn about rock and gem shows in oregon", "are you interested in finding rock and gem shows near you", "are you looking for a list of clubs that host rock and gem shows", "are you looking for lapidary classes", "what local rock and gem shows are you looking for from this list", "would you like to know about rock and gem shows in washington"], ["do you need details on where jax chemical company is", "would you like to place an order", "would you like to see their homepage", "do you need the address of jax chemical company", "do you need info on what jax chemical company produces", "do you need contact information", "do you want a jax chemical company coupon", "do you need info on jax chemical company", "do you need to know who the ceo of jax chemical company is", "do you need product information", "are you interested in a specific type of product", "are you looking for information on the origins of the company", "are you looking for some retailers"], ["which dinosaurs are you interested in", "are you looking for a dinosaur costume or game", "are you looking for a specific dinosaur", "are you interested in home decor items that are dinosaur related", "are you interested in coloring books", "are you looking for a specific web site about dinosaurs", "are you looking for dinosaur books", "would you like a list of dinosaur movies", "do you want a list of dinosaur names", "are you interested in dinosaur toys", "would you like to see pictures or videos of dinosaurs", "are you looking for meat eating or plant eating dinosaurs"], ["do you need the address of east ridge high school", "are you searching for east ridge high school football schedule", "do you need directions to east ridge high school", "in which state are you looking for east ridge high school", "are you interested in east ridge high school latest news", "what information about east ridge high school are you looking for", "are you looking for east ridge high school activities", "are you searching for east ridge high school located in clermont fl", "are you looking for a specific web site", "are you seaching for east ridge high school community education", "are you looking for east ridge high school in woodbury mn", "are you looking for information about the sports facilities at the school"], ["would you like the phone numbers to the va dmv registration", "do you want to renew a drivers license", "would you like hours for va dmv registration", "are you looking for a specific web page", "would you like directions to the va dmv registration", "are you searching for required documentation for vehicle registration", "what services do you want to find information about", "what are in interested in about va dmv registration", "are you looking for physical locations of dmv offices", "are you interested in organ donation information", "do you want to obtain forms from the dmv", "do you want a list of departments within the va dmv registration", "would you like to email the va dmv registration"], ["would you like diretions to arkadeliphia health club", "would you like to kinow the phone nummber to arkadelphia health club", "would you like to be friends on facebook with arkadelphia health club", "would you like to know some website address", "are you trying to compare different fitness centers in arkadelphia ar", "would like a review of arkadelphia health club", "are you looking for a 24 hour fitness center", "would you like information on yelp", "are you referring to a health club in arkadelphia ar", "would you like to take a zuma class at arkadelphia health club", "is arkadelphia in the name of the health club", "would you like to know subsrition pricing to arkadelphia health club", "are you looking for a health club or a country club", "are you looking for any specific information about arkadelphia health club", "are you looking for multiple health clubs in arkadelphia ar"], ["would you like to see trombones for beginners", "are you interested in selling a trombone you own", "would you like to see trombones for sale on amazon", "are you looking for trombone dealers near yo", "are you looking for a place to sell a used trombone", "are you interested in selling or buying a trombone on amazon", "are you looking for a second hand music store near you", "are you looking for a store that sells trombones near you", "would you like to see music stores in your area", "are you interested in selling or buying a trombone on ebay", "would you like to see trombones for sale on ebay", "are you looking for discounted trombines", "are you interested in the price range for trombones"], ["do you want to know what vines for shade are available in your region", "do you want to know how to plant a vine for shade", "do you want to know how many species are there of vines for shade", "do you want to know if you can grow vines in shade", "what growing climate do you live in", "would you like to know cheap ways to grow vines", "do you want to know where to buy vines for shade", "where are you looking to grow the ivy", "do you have any plant allergies", "do you want to know the best vines for providing shade", "are you looking for a flowering ivy", "how fast do you want the coverage to grow", "are you putting the ivy on a trellis", "do you want to knwo vest vines for shade"], ["are you looking for any specific information about the library", "do you need the contact information for the sherwood regional library", "do you want to find a book", "would you like directions to the sherwood regional library", "would you like the see the calendar of events", "do you want to check out a certain book or see if it is available", "are you looking to reserve a space at the sherwood regional library", "do you want to call", "would you like to see the hours of the sherwood regional library", "do you want to know the hours of operation", "do you want the address"], ["would you like to find out how much you owe", "what area are you asking about", "would you like to see a list of states which receive tangible personal property tax", "do you want to know the tangible personal property tax", "do you have any dependents on your record", "what is theh tax rate for the country youre in", "do you want to know who is eligible for the tangible personal property tax", "do you want to know the difference between that and other taxes", "how much do you report for your income", "what is the tax rate for the state you are in", "are you reffering to the federal or state tax", "is this tangible personal property tax just for you", "would you like to know the current rate"], ["do you want to know if martha stweart works for the company", "would you be interested in learning more about martha stewart and imclones history", "are you interested in martha stewarts role in the company", "are you seeking to watch martha stewart and imclone", "are you interested in something specific about martha stewart and imclone", "would you like to know what more about the history of martha stewart and imclone", "are you interested in what the the company imclone does", "are you looking for specific information about martha stewart and imcones age", "do you want to know if this is the company marthat stewart was given insider trading information", "which martha stewart and imclone television show episdoe are you looking for", "are you looking for a specific web site", "do you want to know if this is the company martha stewart went to jail for", "do you want to know who owns the company imclone"], ["would you like to know about yellowstones history of eruptions", "would you like to know trending data or a timeline for the uplift at yellowstone national park", "would you like to know why some scientists think the yellowstone volcano is in the process of dying", "may i tell you the numnber of earthquakes recorded in the past month in the yellowstone area", "what would you like to know about uplift", "would you like to see a ground map showing the uplift of yellowstone national park", "do you want to know what the current uplift is at yellowstone national park", "what makes people think the yellowstone volcano will erupt soon", "would you like to know more about what would occur if the supervolcano underneath yellowstone national park errupted", "can i tell you about the north american plate that moves causing the eventual destruction of the volcano in yellowstone park", "are you looking for a specific web site", "are you interested in a specific aspect of uplift at yellowstone national park", "would you like to know more about geothermal activities at yellowstone national park", "would you like more information of the course of the yellowstone volcano and the different hypothesizes scientest have"], ["do you want an espn sports schedule", "do you want to know who owns espn", "do you want espn sports corporate information", "do you want information about espn sports personalities", "do you want to know when espn started", "do you want information about espn sports programming in languages other than english", "are you looking for standings of a specific sport", "do you want information about which sports espn covers", "do you want to know what channel espn is", "what sport are you interested in", "do you want to know about special events on espn", "are you looking for information on a specific sport", "do you want information about a specific espn sports program", "are you looking for information on a specific league", "do you wnat sports scores"], ["are you interested in the history of the pcoconos", "have you been to the poconos before", "where in pocono are you interested in", "are you interested in lodgings", "what would you like to do in the poconos", "would you like to know more about pocono raceway", "do you want to know the latest weather updates for pocono mountains", "are you looking for the information about split rock restore", "what would you like to learn about the poconos", "what kind of place would you like to stay at in the poconos", "which mountain ski resort would you like information around the pocono area", "are you referring to pocono mountains", "would you like to book a flight to pocono couples retreat", "when are you going to the pococnos"], ["are you interested in figs health benefits", "would you like us to show you where to buy figs and other fresh fruit locally", "are you interested in the calorie count or other nutrition information for the fruit", "would you like to know where you can buy figs", "are you looking for recipes with figs", "if youre interested in recipes would you like savory or sweet receipes do you have other specific ingredients in mind", "what variety of figs are you interested in", "would you like to know what figs taste like", "would you like to know the climate figs are found in", "would you like to watch videos about how figs grow andor how to prepare them", "are you interested in recipes you can make with figs fresh or dried", "would you like to know where figs grow", "would you like to know more about growing figs", "would you like to see a list of different kind of figs with images", "are you interested in the fruit or are you looking for the clothing brand that sells scrubs"], ["do you want to know the cost of attending the university of phoenix", "are you looking for any specific faculty member of university of phoenix", "do you need the website for the university of phoenix", "is there any specific information that you need about online courses held by university of phoenix", "are you looking for reviews of the university of phoenix", "are you interested in comparing university of phoenix with other universities in any specific aspect", "do you need contact information for the university of phoenix", "what major are you interested in", "do you need admission information for the university of phoenix"], ["are you looking for the business near you", "are you looking for the basics of septic system design", "are you interested in an avanced treatment below ground design", "are you interested in a tank design or one that dumps into open water", "are you looking for the cost", "do you want to know about alternatives to a septic system", "are you interested in a pressure distributon design 2 feet of absorbant soil", "are you interested in a standard gravity type of design 3 feet of absorbant soil", "are you looking for information on its maintenance", "do you want a single large lateral or multiple smaller laterals", "are you looking for engineers in such field", "are you interested in an advanced treatment above ground design", "would you like to know how it functions", "ae you looking for examples of septic system design", "are you trying to find a contractor", "are you looking for septic system design software"], ["are you interested in schools in poterville", "do you want the history of porterville", "is there any specific web page on your mind", "do you need information about medical services", "are you wondering where porterville is", "are you looking for a contact number for the city government", "are you looking for a hotel near porterville", "would like to know about any specific sports team", "are you looking for a specific place here", "are you looking for attractions near porterville", "are you looking to move here", "are you wanting directions to porterville", "do you want to find a restaurant or store here", "are you looking for any specific venues in porterville"], ["would you like the location of the arizona fish and game comission", "are you referring to the arizona state wildlife department", "do you want information about the arizona game and fish department", "would you like to see arizona hunting trip information", "would you like information on arizona wildlife", "do you want information on arizona wildlife", "are you looking for a specific web page", "do you want to get a hunting or fishing license in arizona", "would you like to see information on fishing in arizona", "are you looking for hunting guides", "would like to go hunting or fishing in arizona", "are you looking for regulations related to your search", "do you need to find hunting and fishing grounds in arizona", "are you looking for a specific web site", "would you like the arizona state fish and game comissions contact information", "do you need maps for arizona hunting and fishing"], ["do you want to see cookbooks for grilling", "do you want to know about grilling meat", "do you need to know how to trun a grill on", "are you looking for gas grill instruction", "are you interested in kabob recipes", "do you want more informaiton about grilling vegtables", "do you want to know more about the grilling process", "are you looking for a recipe for grilled fish", "are you looking for the magazine the grilling", "are you interested in grilling equipment", "are you interested in grilling a specefic food", "do you need to know where you can purchase a grill", "do you want to know about indoor or outdoor grilling", "are you referring to a gas grill", "are you interested in a recipe for grilled chicken", "are you looking for a grill for grilling food"], ["do you want to know how much dnr costs", "would you like to know more about hunting rules", "do you mean the department of natural resources", "are you interested in dnr stock", "are you interested in the medical term dnr", "what specific dnr are you referring to", "do you want to know if dnr is legal where you live", "would you like to fill an application for a hunting licence", "are you referring to the the department of natural resources in maryland", "do you mean do not resuscitate", "would you like to contact a lawyer about a possible dnr", "do you want to know the legality of dnr", "are you referring to the company or the term do not resuscitate", "would you like to know where you can get cpr certified"], ["would you like to read about colleges in arkansas", "do you want to know the most famous person from arkansas", "do you want to know how to get to arkansas", "do you need to know the next arkansas game time", "are you looking for what country arkansas is", "which city in arkansas are you interested in", "are you interested in learning about arkansas", "do you need a map of arkansas", "do you want information on jobs in arkansas", "are you looking for arkansas history", "do you want to go to arkansas", "are you looking for weather in arkansas", "do you want to move to arkansas", "are you looking for arkansas football"], ["would you like to know about david thompson", "would you like to know how far barbados is", "what city in barbados are you interested in learning", "are you interested in visiting barbados", "are you interested in facts about barbados", "would you like a map of barbados", "are you interested in the history of barbados", "are you interested in barbados flag", "are you interested in barbados", "are you interested in barbados ecology", "are you looking for a specific website", "would you like to find a plane ticket to barbados", "would you like the latest news of barbados", "would you like to know where barbados is"], ["do you need treatment information for lipoma", "would you like to know about lipomas based on any specific demographics", "would you like to know what causes lipoma tumors", "are you referring to malignant lipolysis", "do you want to know the cost of lipoma removal", "are you looking for a clinic for lipoma treatment", "are you looking for nearby medical practices that treat the condition", "is your search referring to a condition of the neck", "are you looking for lipoma removal", "are you looking for the definition to lipoma", "are you trying to locate the causes for lipoma", "are you referring to a medical condition for your pet", "are you referring to lipomassage", "are you searching for an image for lipoma", "would you like to know more about animals that present lipomas", "are you searching for the information in regard to lipoma symptoms"], ["do you need info on remedies", "do you need the cause of the injury", "do you want to know how to treat the injury", "do you want to know what the symptoms of a hip fracture are", "which age group is of more interest to you", "are you referring to the injury", "do you need to know what are symptoms of the injury", "are you interested in the age breakdown of common hip fracture sufferers", "do you want to know where to get treatment for a hip fracture", "were you looking for the causes of hip fractures", "are you interested in any specific statistics for fractures", "are you interested in treatments for hip fractures"], ["would you like to know about early signs of a heart attack", "which symptoms do you believe you are experiencing", "is this an emergency", "would you like me to direct you to emergency services", "what age group are you reffering to", "would you like to know how to prevent these signs", "are you at risk for having a heart attack", "are you experiencing a heart attack", "would you like to see the signs of a heart attack in women or in men", "would you like to see ways of temporarily slowing a heart attack", "are you interested in knowing what to do in the event of someone having a heart attack", "do you know what a heart attack is", "do you want to know about the signs based on any specific demographics", "is someone you know experiencing a heart attack"], ["do you want to learn how to install weather strips on doors", "would you like information about installing weather stripping", "do you want to learn how to install weater strips on windows", "would you like to know where to buy weather strips", "are you interested in weather strips for windows", "would you like to compare different weather stripping products", "would you like to know if it is possible to weather strip a car", "would you like to know more about sliding glass doors", "would you like to purchase a weather stripping product", "are you interested in weather strips for doors", "would you like to know what a weather strip is", "would you like to learn about weather stripping"], ["when do you expect to need coverage to begin", "would you like to find out the different types of payment options for the best long term care insurance", "are you interested in the cost for best long term care insurance or short term", "are you looking for a specific insurance company", "do you plan to sign up for coverage online", "what area of the country do you live in", "are you interested in more information on the best long term care insurance", "do you think the best long term care insurance is right for you", "would you like to know the age should to start buying best long term care insurance", "would you like to buy a book on the best types of best long term insurances and learn more about it", "are you interested in comparing coverage prices", "are you interested in getting a quote for coverage", "are you interested in the best priced long term care insurance or best coverage"], ["are you interesting in a certain countrys black history", "are you interested in history in the united states", "are you looking for black history figures", "are you interested in black history", "are you interested in black celebrities", "are you looking for something to read", "do you want to know major landmark dates", "do you want to know about a specific person", "do you want to know famous black people", "are you looking for black history books", "are you looking for a specific event or activity", "how far back do you want to learn about black history"], ["do you need help finding your new york hotel", "are you looking for a chain or botique hotel", "what is your price range", "do you need a map of hotels", "are you looking for reviews of hotels", "would you like to book a new york hotel", "are you interested in new york hotel prices", "do you need a list of available new york hotels", "is there a specific neighborhood you are interested in", "do you need direction to your new york hotel", "is there a specific hotel you are looking for", "would you like a list of new york hotels"], ["are you looking for a specific web site", "are you looking for casinos in kansas city missouri", "are you interested in kansas city mo tourism", "would you like to directions to kansas city", "would you like to see a map of kansas city mo", "are you interested in upcomming events in kasas city mo", "are you interested in hallmark visitors center", "would you like to know about things to see and do in kansas city mo", "are you interested in job openeings in kansas city mo", "are you looking for an apartment in kansas city mo", "would you like to know the zip code of kansas city mo", "would you like to know the weather in kansas city", "are you interested in recent news headlines from kansas city mo", "would you like to see a listing for hotels in kansas city", "are you interested in visiting kansas city"], ["would you want to know credit report scores", "do you want information on what is in a credt report", "are you interested in a list of companies in which you can get credit reports", "are you interested in learning how to read your credit report", "are you wanting a copy of your credit report", "would you like to know about the process of disputing credit report", "would you want to know what is in a credit report", "may i provide you a list of best credit reporting agencies", "are you interested in learning if your credit report is safe", "do you want to know how to obtain someones credit report", "wou you like to know more about 3in1 credit reports", "would you like to know about credit scores", "would you like to know more about free credit reports", "do you want information on how to keep your credit report good", "would you like to know more about a certain credit reporting company"], ["do you want to learn about unc the school", "do you want to know the location of unc", "would you like to learn about unc sports", "what part of unc do you want info on", "which unc are you interested in", "is unc the name of a game", "do you want to know the colors of unc", "which unc campus are you most interested in", "would you like information on the university of north carolina unc", "what does unc mean", "which area of study are you looking for at unc", "are you interested in any specific activities at university of carolina", "are you interested in the whereabouts of the university of carolina", "would you like to learn about the unc campuses"], ["do you want to contact somebody here", "do you want to know the history", "do you want to know the population", "do you want a map", "do you wish to know the climate of vanuatu", "are you looking for flights to vanuatu", "are you interested in visiting", "are you looking for anything specific of a tv show", "are you looking to book a trip to vanuatu", "is your question about tourism in vanuatu", "are you interested in the location of vanuatu"], ["do you want to know internet phone service providers", "do you need information on residential or business", "are you interested in price comparison of packages", "do you want to know the cost of internet phone service", "would you like to know how to sign up for internet phone service", "are you looking for a free internet phone service", "do you need information about voip phone services", "do you need information on the speeds available in your area", "do you need technical support related to your service", "are you looking into price difference of companies in your area", "would you like to know how internet phone service works", "are you looking for free internet phone service or are you willing to pay for it", "which internet phone service providers are you interested in", "is there a specific internet company you need information on"], ["are you looking for information about any specific federal agencies", "which gs tax bracket are you looking for", "would you like to see a gs salary calculator", "do you need any specific information in relation with the federal wage system", "do you want to know the pay range for a specific payscale", "do you want to know the federal pay cap for 2018", "are you looking for the us civil servant pay scale", "are you looking fro a gs base payscale table for 2018", "what gs pay scale are you looking for", "are you interested in applying for federal jobs", "do you need a gs pay calculator", "would you like to see the base pay scale for 2018", "what year do you want to know the gs pay rate for", "would you like to know more about the history behind the gs pay scale"], ["are you trying to find out if you could listen to the current music on youtube for free", "are you interested in the current fm channel", "are you trying to find out who is the owner of the current fm station", "are you looking for the magazine the current", "which one of the current 893 essential songs do you like", "when do you want to go to the current chart show", "are you looking for current playing list"], ["are you looking for homeopathic sore throat treatments", "are you looking for medicines to treat a sore throat", "would you like to see symptoms of this", "do you have a fever", "are you looking for doctors that treat sore throats", "are you wanting to know the illnesses that list sore throat as a symptom", "would you like to see pictures of a sore throat", "would you like things to do to soothe a sore throat", "are you wondering what causes sore throat", "do you have pain on both sides of your throat", "do you have a cough as well", "would you like to know more about throat cancer", "are you looking for some medication"], ["would you like to see some pictures of it", "are you interested in where they grow", "do you want to know when the idaho state flower was named", "do youwant to know what year idaho declared a state flower", "are you interested in the histroy behind it", "what characterisitc of the flower would you like to learn more about", "would you like to know what the idaho sate flower is", "would you like to know how big they grow", "are you looking for some fun facts", "do you want a crossword puzzle about idaho", "do you want to know how to take care of it", "would you like the idaho state flower coloring page", "do you want to see images of the idaho state flower", "would you like to know about its apperance"], ["what event do you want to attend at the fairgrounds", "are you looking for historical information about the indiana state fairgrounds", "do you want to attend the indiana state fair", "do you want to know the size of the indiana state fairgrounds", "would you like the history of indiana state fairgrounds", "are you interested in any specific events here", "do you need directions to the indiana state fairgrounds", "do you want to know the city where the indiana state fairgrounds are located", "would you like to know where indiana state fairgrounds is on a map", "do you need an event schedule for the indiana state fairgrounds", "would you like to buy tickets for a specific event there", "do you want the location of the indiana state fairgrounds", "do you need the address of the indiana state fairgrounds"], ["are you looking for any specific support group in relation to fybromyalgia", "are you looking for a diet to help manage fibromyalgia", "are you experiencing a flare up", "is there something you need to know about this condition", "are you looking for a medication to adress the symptoms", "do you want the definition of fibromyalgia", "do you need to find a doctor that treats fibromyalgia", "do you want information on treatments for fibromyalgia", "do you need mediciation for fibromyalgia", "do you need to know the cause of it", "what type of fibromyalgia statistics are you looking for", "are you looking for symptoms of fibromyalgia"], ["are you interested in french lick resort and casinos hours of operation", "are you looking for deals and offers related to french lick resort", "do you need directions to french lick resort and casino", "would you like to be hired by french lick casino and resort", "do you have a preference of the casino in french lick", "do you need to know all of the locations for french lick resort and casino", "would you like to see all listings for casinos in french lick", "are you looking for a specific web page", "are you looking for casinos near french lick resort", "are you looking for a particular casino in french lick", "do you want the distance between your current location and french lick resort and casino", "should i provide you with the contact information for french lick resort and casino", "do you want reviews of french lick resort and casino", "would you like to see resorts and casinos in the french lick area"], ["are you looking for a specific web site", "would you like to know what country volvo is located", "would you like to know what their rating is compare to other car companies", "do you need information about a volvo dealership", "are looking for reviews on volvo xc90 suv", "would you like to buy semi truck", "are you looking to buy a volvo", "would you like to know what are their most popular vehicles", "are you interested in the size of the company", "are you looking for a dealer in a specific location", "do you need repair information", "are you interested in who is the ceo", "which model of volvo are you interested in getting information about", "are you asking what year the company originated", "is your volvo having a maintenance issue", "what year of volvo do you need information about", "which part of volvo are you interested in"], ["are you referring to the pastor", "are you looking for a political debate", "do you want to know how old rick warren is", "do you know someone named rick warren", "are you looking for a specific web page", "are you looking for the age of rick warren", "do you need any specific information on obama inauguration", "are you trying to find more information about rick warren", "are you wanting to see sermons by the pastor", "are you wanting to see videos by the pastor", "are you seeing if rick warren is still alive", "are you referring to the author", "are you wanting writings by the pastor"], ["are you referring to the insane person across the street", "do you want to access yahoo mail", "are you referring to a crazy person", "do you want to access yahoos twitter feed", "do you want to know about yahoo the company or yahoo the word", "are you referring to the email client", "are you referring to the internet browser", "what would you like to know about yahoo", "are you referring to the search engine", "are you talking about the stock price of the giant", "do you want to know how yahoo is performing as a business", "do you need to contact yahoo", "shall i take you to any specific pages of yahoo web site"], ["would you like to find exercises to lower your heart rate", "would you like to know what effects hart beat rate", "do you want dietary recommendations", "would you like to know why its important to lower your heart rate", "how would you like to lower your heart rate", "do you have high blood pressure", "do you have any medical conditions", "are you planning to run or exercise", "how much do you need to lower your heart rate", "what is the heart rate youre looking to achieve", "would you like to know about normal heart rate", "how low would you like to lower your heart rate", "have you talked to your doctor about heart rate", "would you like to find foods that will lower your heart rate", "would you like to know what effects blood pressure and cholesterol"], ["would you like to know more about kagome higurashi", "would you like to see inuyasha manga", "would any specific game interest you", "which episodes of inuyasha would you like to see", "are you interested in the music from inuyasha", "are you interested in a certain inuyasha character", "are you interested in inuyasha cosplay", "which inuyasha characters are you interested in", "are you interested in the list of inuyasha characters", "would you like to know more about the inuyasha illustrator and writer", "are you looking for any specific pictures", "are you interested in inuyasha wiki activity", "are you interested in a specific season of inuyasha", "are you interested in the years inuyasha was shown in tv", "are you looking for specific fanrelated information", "would you like to watch an inuyasha movie", "how would you like to watch inuyasha episodes"], ["would you like to learn how to cheat in ps2 games", "which ps 2 game genres are you interested in", "are you looking for ps 2 games prices", "would you like to see a list of new released ps2 games", "how many ps 2 games are you looking to buy", "are you looking for stores to buy ps 2 games from", "what is the most you are willing to spend on a ps 2 game", "what types of ps 2 games do you like to play", "would you like to compare specific ps 2 games", "is the ps 2 games for a child or an adult", "would you like to know more about ps2 console design", "are you referring to playstation 2 games", "are you looking for ps 2 adventure games", "which ps 2 game franchises are you interested in", "are you interested in playing ps 2 games on other consoles such as playstation 3 and playstation 4"], ["are you in the beginning or more advanced stages of getting organized", "are you looking for specific products related to getting organized", "are you wanting help with what to do to get organized in your home", "how about some organizing tips", "are you referrring how to get organized", "do you need tips on diy organizational methods", "are you looking to organize your course work", "would you like to know how to reduce clutter", "do you need to find out how to organize your pantry", "are you looking for a specific web site", "what area of your home would you like to organize"], ["do you want to find some resoutces", "are you searching for a local educational program", "what are you trying to learn about diabetes", "are you wanting to join a diabetes education gtoup", "who you be interested in becoming a diabetes educator", "which type of diabetes do you want to learn about", "are you looking for diet information", "do you want help finding a medical doctor for diabetes education", "diabetes education regarding children or adults", "are you wanting to find a class on the education of the disease of diabetes", "are you looking for a specific web site", "are you searching for prevention tools", "are you looking to take a class about diabetes", "are you interested in an online site for diabetes"], ["would you like to play atari arcade games online", "are you interested in buying a new atari game console", "are you interested in atari 2600", "are you interested in the history of atari", "which atari computer system would you like to know about", "are you interested in classic atari games or current atari games", "would you like to see a list of atari games", "are you interested in atari games or information about the brand", "which atari game are you interested in", "which atari game system would you like to know about", "are you interested in playing online games", "do you want to purchase an atari game"], ["would you like to register a domain name", "what type of website do you need", "how much are you willing to spend monthly for hosting", "are you interested in paid services", "do you need a tool to design the site", "how much data do you need stored", "what aspect of website desgin hosting are you interested in", "what are your requirments", "are you interested in free websites or would you like your own domain", "would you like to see reviews for website hosting and design companies", "is it for a blog or for online retail", "what price range are you looking for", "do you want to compare prices for website hosting and design", "are you looking for someone to design a site for you or a site that allows you to do it yourself", "would you like to take some courses on web design"], ["would you like a list of websites that show workouts for elliptical trainers", "would you like to know where you can buy a discounted or used elliptical trainer", "are you looking for a suitable elliptical machine to use at home", "would you like prices of elliptical trainer", "are you interested in different brands of elliptical trainer", "would you like to see reviews on elliptical trainers", "are you referring to the machine or person", "do you want stores selling elliptical trainer", "are you looking for information of where to buy a elliptical trainer", "do you want more information about the benefits of an elliptical trainer", "are you looking for information of a trainer vs a treadmill", "are you looking for benefits of an elliptical trainer vs other fitness machines", "are you looking for a class for elliptical trainer", "is there a specific brand that you would like to know more about"], ["what cell phone apps are you interested in", "what price range of cell phones are you interested in", "were you looking for how cell phones work", "would you like an unlocked phone", "are you looking for cell phones for kids", "are you looking for prepaid phones", "are you trying to compare android to ios", "do you need information about cell phone plans", "what brand of cell phones are you interested in", "are you looking for a new phone with a specific carrier", "are you interested in a specific brand of cell phone", "did you want to know what the most popular cell phones are"], ["do you want to know how many gps satellites are active", "are you looking for instructions on how to use your gps device", "are you looking for reviews of gps apps", "would you like information on how gps works", "woud you like to know the many uses of gps", "are you interested in how gps was orginally made", "are you interested in the accuracy of the gps", "would you like to know your gps coordinates", "what brand of gps device are you looking for", "would you like to know how gps works", "are you looking for car navigators", "are you looking for gps accessories", "do you need directions somewhere", "are you looking for any specific device equipped with gps"], ["how big do you want your dog", "would you like an active or relaxed dog", "do you want to adopt dogs for free", "how much would you like to pay for a dog", "what adoption agency or shelter would you like to use", "would you like to how to adopt a dog", "are you looking for a specific website", "what breed of dogs are you looking for", "are you willing to adopt a shelter dog", "do you want to adopt from a shelter or an individual owner", "would you like to see local spca or humane societies", "what location would you like to search for dogs in", "what breed of dog are you looking for"], ["do you need information about special deals", "do you want to know how much it costs to stay here", "are you trying to rent at a disneyland hotel", "are you looking for details about disneyland hotels", "are you wondering where disneyland hotels are located", "do you want a phone number to call", "are you interested in staying here for certain dates", "are you looking for a hotel inside disneyland", "are you looking for directions to a disneyland hotel", "would you like to read some reviews", "do you want the address", "do you want to book a stay here"], ["would you like to know the best way to clean a toilet", "do you need to know how to measure a toilet for installation", "are you trying to find specific toilet parts", "are you looking for specific products related to toilets", "what type of toilet are you looking for", "what size is your toilet", "would you like a new toilet", "are you looking for toilet cleaners", "do you have a specific toilet brand on your mind", "should i search nearby stores for discounts on a toilet", "would you like to know about different types of toilets", "are you looking for topics related to bathroom health", "do you need information on how to install a toilet", "do you need to repair your toilet", "what brand is your toilet", "are you trying to fix your toilet"], ["would you like to read reviews about michworks", "are you interested in more about the company", "are you looking for the location of michworks", "are you looking for michworks career information", "would you like application information for the michegan works program", "are you searching for workers for your company", "do you need help navigating the website", "what division of michworks are you interested in", "are you looking for a specific job or the job search site", "can i take you to the resource page at the michworks website", "do you want to know the number of available jobs on the website", "would you like help searching for work in michigan", "do you need need information related to unemployed services in michigan"], ["are you trying to find videos about the music man", "do you want to watch the music man film", "are you looking for reviews of the music man", "are you looking for lyrics from the songs from the music man", "are you interested in the music man", "are you looking for showtimes for the music man", "do you want to know the actors in the music man", "do you need tickets for the music man", "are you looking for the current performance of the music man", "are you looking for the script for the music man", "do you want to know the cast of the music man", "are you looking for information on the music man musical", "are you looking for a summary of the music man plot", "do you want to listen to songs from the music man"], ["in what country is the secret garden located", "what kind of media are you interested in there are many videos and still frames of the secret garden from its movies plays tv musical and opera productions", "are you interested in the original classic book by frances hodges burnett", "the secret garden has been made into many films and series which version of the secret garden are you intrested in", "would you like to know more about the short story by g k chesterton", "can i provide you information about frances hodgson burnett", "is the secret garden a book you are interested in", "are you interested in educational reviews and essays about the secret garden for a homework assignment", "would you like to see reviews on specific movies and tv shows", "are you interested in gardening", "are you interested in visiting a secret garden", "can we show you reviews of the original classic book the secret garden", "are you looking for a garden in you area"], ["what is the doctors name at this facility that you want", "what location of alexian brothers hospital do you want to know about", "do you want to make an appointment", "are you looking for our schedule of classes or events", "which alexian brothers hospital are you interested in", "do you want to pay a bill", "do you need an address", "are you looking for job openings at alexian brothers hospital", "are you interested in what services alexian brothers hospital offers", "which hospital facility are you look for", "do you need their homepage", "do you want the contact info for alexian brothers hospital", "are you looking for the alexian brothers lay catholic order"], ["would you like to know about where to purchase a wilson antenna", "are you looking for wilson antenna parts", "what kind of wilson antenna are you interested in", "what do you want to use the antenna for", "what model of wilson antenna are you inquiring about", "are you looking for a specific web page", "are you looking to buy an antenna or read more about the antenna", "where are you looking to mount the antenna", "do you have a specific purpose for the antenna", "which type of antenna are you interested in", "do you need to get a part of a wilson antenna", "would you like to read some reviews of wilson antennas", "do you have questions about the wilson antenna warrenty"], ["are you interested in finding a local tattoo shop that does flame design", "what kind of pictures are you looking for", "do you want realistic or cartoonish designs", "would you want to buy flame design stickers", "are you looking for flame designs for a tattoo", "how big do you want the flames to be", "would you like to buy stencils online", "the history of flame design", "what are you using the design for", "what colors do you want to use", "are you looking for flame design outline", "should there be anything else besides the flames", "do you want black and white or colored designs", "are you looking for flame design tracers"], ["should i request an application to mitchell college", "would you like directions to mitchell college", "would you like to know about the admission procedure of mitchel college", "are you looking for mitchell colleges course catelog", "do you want to know when the next semester starts at mitchell college", "are you looking for information on mitchell college in connecticut", "are you referring to the college in new london conneticut", "are you looking for pages that compare mitchell college with others", "are you looking for mitchell colleges tuition rates", "would you like to know mitchell colleges acceptance rate", "are you interested in a specific web page", "are you interested in the ranking of mitchell college", "what state is mitchell college in"], ["are you interested in pet health supplies", "do you want to know how long a female dogs heat lasts", "would you like to know how to care for your dog during heat", "would you like to know if spaying would stop the heat of a female dog", "is your dog acting strangely like they are in heat", "would you like to know why dogs heat up", "would you like to know the symptoms of a dog in heat", "do you need directions to your local vet", "do you think your dog is in heat", "are you looking for any specific heatrelated illness in dogs", "are you looking for symptoms of dog heat", "what would you like to know about the dog heat season"], ["would you like information about the association of volleyball professionals", "are you looking for avp beach volleyball", "are you looking for the stock symbol avp", "would you like to know what avp stands for", "do you want a spell check for avp", "do you want to know how male vs female avps in a company", "are you referring to alien vs predator", "would you like information about the alternatives to violence project", "would you like stock information for avon products incorporated", "are you referring to a software", "are you looking for any specific information in relation to beach volleyball", "would you rather read some reviews about avp antivirus", "would you like to know about the alien versus predator movie", "do you want an acronym meanining for avp", "are you looking for a specific web site", "are you referring to a specific company", "do you want to know about a management position"], ["are you looking for a deadliest catch product", "is there any specific type of product on your mind", "do you need a phone number", "is there a specific product you are looking for from the store", "do you need to see what is sold there", "do you wish to order online directly", "shall i open discovery channel store homepage", "are you looking for a mythbusters product", "are you looking for locations", "are you looking for a certain store location", "are you needing store information", "do you want to see the store catalogue"], ["what year do you want to know the president for", "are you interested in history of presidents", "do you want to learn about our president", "do you want information on the current us president", "are you looking for the first president ever", "which president are you looking for", "are you interested in learning about a presidents power", "do you want to know the term length of a us president", "do you want to know about the office of the president of the us", "do you want to know how a us president is elected", "are you looking for a list of all us presidents", "are you looking for the current president of the united states"], ["woud you like a list of items made from iron", "would you like to know about iron deficiencies", "do you want to know how to craft tools made of iron", "are you trying to determine whats a safe amount of iron in your blood", "would you like to know how iron is mined", "are you looking for a list of foods that are a good source of iron", "would you like to buy supplements", "do you want to know the iron composition of steel", "would you like to know information about iron fe", "are you looking for iron metal products", "do you know about why its important to have iron in your diet", "would you like to know irons atomic number or mass", "are you looking to buy an iron for your clothes", "are you looking for irons melting point", "would you like to figure out iron alloys used to make stainless steel", "are you interested in knowing how iron is made"], ["what type of activity are you looking for", "do you need information for group or individual ticket prices for tours of the uss yorktown", "are you looking for homes or demographic information", "what kind of aircrafts would you like to know about", "which holiday season are you interested in", "what things to do and see are you interested in", "would you like the history of the uss yorktown or information on visiting it", "do you need directions from your location to the uss yorktown", "what type of accomodations are you looking for", "would you like to see reviews of the uss yorktown tour", "do you want to know where the uss yorktown is currently located", "what events are you interested in on the uss yorktown", "what historic period would you like information pertaining to"], ["are you looking for ct jobs in your area", "which part of connecticut are you interested in", "are you interested in the common jobs in connecticut", "is there any specific web page on your mind", "what kind of trade are you looking for", "are you looking for jobs in the state of conneticut", "do you want to know more about jobs in connecticut", "do you want to know the average salary in this state", "are you looking for any legal information", "are there specific jobs you are looking for", "do you want to know who is hiring here", "what salary range are you looking for", "are you looking for listings with a particular skill set"], ["would you like to buy a book about this topic", "are you interested in the animal or the hockey team", "are you looking for some photos", "are you looking for any specific information about the birds", "do you want to hear pittsburgh penguin news", "would you like to see penguins of madagascar", "would you like to know the penguins schedule", "are you interested in a specific type of penguin", "are you looking for a specific web page", "would you like to buy some stuff related pittsburgh penguins", "do you want to watch funny penguin videos", "are you interested in where penguins live", "are you interested in the penguins of madagascar", "are you interested in penguin vape", "do you want to hear about the pittsburgh penguins", "what kind of penguin are you looking for", "are you referring to the move"], ["will this be a tall fence or short fence", "are you keeping people out or animals in", "are you using this around the yard", "are you trying to build a specific kind of fence", "are you looking for instructions to build a fence", "are you looking for companies to build a fence for you", "are you looking for places to buy fencebuilding materials", "are you interested in the costs of building a fence", "are you looking for fencebuilding materials", "is there a specific material it needs to be made from wood cement tin", "will this be used as a animal pen"], ["are you interested in a school district", "do you want to know about railroads", "are you trying to find out about the kcs mental health clinic", "do you want to know about kennycaffey syndorme", "are you looking for the kcs academy", "are you trying to look for kucoin shares cryptocurrency", "would you like to see info about the kansas city southern railway", "are you looking for korean community services", "what entity are you referring to with this acrocym", "are you looking for a specific energy related company", "are you interested in learning more about knowledgecentered service", "are you referring to knowledge centered support", "are you looking for furniture"], ["are you referring to bellevue iowa", "are you looking for the university the bellevue", "are you looking for a hospital in new york ny", "are you looking bellevue square mall", "do you want to know about the nearest town named bellevue", "are you looking for things to do in bellevue", "are you looking for the college", "are you looking for directions to bellevue", "are you referring to bellevue nebraska", "do you want to know more about companies headquartered in bellevue washington", "would you like to see notable residents of bellevue washington", "are you looking for bellevue baptist church", "do you want to know more about the bellevue washington local government", "do you need information about bellevue nebraska", "are you referring to bellevue washington"], ["do you want to know how many different types of worms there are", "do you want to know about worm castings", "are you looking for information on the life cycle of worms", "are you interested in pictures of worms", "would you like to know what a conficker is", "do you want to find out about the animal worm or a why a person is called a worm", "are you looking for information about computer viruses", "do you want to know where worms come from", "do you want to know facts about the creature worm", "are you interested in the computer game worms", "do you want to learn where to purchase fishing bait", "do you want to know about worms in dogs", "are you trying to find out what worms eat", "are you interested in knowing more about a computer worm"], ["are you interested in ways to fix problems flushing the toilet", "would you like directions to flushing new york", "are you referring to flushing new york", "what flushing are you interested in toilet or facial", "what aspect of the flushing remostrance would you like to learn more about", "would you like to know about the plumbing mechanisms of flushing", "arey you conerned about someones face becoming red", "would you like to see diagrams of how a toilet flushes", "would you like to know about blushing", "are you looking for a specific product in flushing queens", "what items are you interested in flushing down the toilet", "which battle would you like to learn about how the technique of flushing was used", "do you want to know why your face is flushing", "are you looking for a directions to the new york hall of science in flushing meadows corona park"], ["are you looking for books on the korean language", "are you wondering who speaks the korean language", "are you looking for information about hangul", "are you looking for a dictionary", "are you interested in korean language classes", "are you interested in the history of the korean language", "are you looking for korean language symbols", "are you looking for nearby classes", "are you interested in korean language degrees", "are you trying to learn the korean language", "do you wish to take a korean language test", "do you need korean language classes"], ["do you want to file your income tax return through the internal revenue online", "would you like to know more about hr block", "did you need clarification on your tax return", "are you looking for information about efiling federal income tax return", "would you like to file your income tax return online", "are you wanting to find income tax forms online", "do you want to know the status of your return", "have you used jackson hewitt before", "do you want to file your income tax online", "how did you file your previous year taxes", "are you looking for a specific web site", "do you need to apply for a federal tax return online", "would you like information on filing income taxes", "do you want names of companies that file income taxes online", "do you need to register to file your tax return online"], ["what age range would you like to see recommended vldl levels for", "what would you like to know about vldl levels", "would you like to know more about ldl", "vldl and ldl are both considered types of bad cholesterol", "would you like to see charts about vldl levels", "do you want to learn how to calculate your vldl levels", "would you like to know how to get your vldl levels tested", "a total cholesterol of 180 to 200 mgdl 10 to 111 mmoll or less is considered best levels between 70 and 189 mgdl 39 and 105 mmoll are most often considered too high", "would you like information about cholesterol reports", "would you like to take a survey on your cholesterol", "are you interested in ways to reduce vldl levels", "would you like information on how to mitigate vldl levels", "would you like a recommendation on nearby doctors who check cholesteral levels", "are you interested in information about the difference between vldl and hdl levels", "what levels of vldl levels are you looking for normal or abnormal"], ["is this in reference to plumbing or some other sort of plastic product", "may i provide you medical definition of premature ventricular contractions", "what type of craft are you using the pvc for", "are you interested in a certain length of pvc pipe", "would you like to know what pvc is made of", "would you like to know about premature ventricular contractions medical treatments", "are you interested in pvc pipe", "do you want to know how to make ballet bars out of pvc", "are you interested in a certain fitting for a pvc pipe", "would you like to learn more about pvc pipes and fittings", "are you interested in how pvc is made", "are you looking for methods on how to repair leaks in pvc pipe", "what aspect of pvc are you interested in the manufacturing or the applications", "are you interested in types of pvc pipe", "what project do you want to use the pvc for", "are you looking to buy pvc pipe"], ["can you read sewing patterns", "would you like to know how to sew on a button", "are you interested to teach sewing to children", "would you like written instructions or a video", "would you like to know how to sew a dress", "would you like to know some basic tips for sewing", "are you looking for sewing patterns", "would you like a book about sewing", "would you like instructions on how to use a sewing machine", "using needle and thread or a sewing machine", "would you like to know to to mend a shirt", "how experienced are you at sewing", "would you like to learn basics for sewing"], ["are you interested in the quote from shakespeare or the quote used in another context", "do you want to know how others have used that quote", "are you interested in shakespeares plays", "do you want to know where the quote came from", "are you talking about a psychology course", "are you referring to a certain philosohper", "are you referring to a philosophy book", "are you talking about a psychology book", "do you want to know the meaning of the quote", "are you referring to shakespear", "are you referring to the philosopher aristotole", "would some analysis of hamlet be interesting to you", "are you interested in the quote from hamlet"], ["are you looking for the news paper the sun", "are you looking for a special news", "are you looking for how long it takes light from the sun to get to the earth", "do you want to know facts about the sun", "are you interested in the suns temperature", "are you looking for how hot the sun is", "are you interested in objects orbiting the sun", "are you looking for information about how big the sun is", "do you want to know how far the sun is away from different planets", "are you interested in the suns life cycle", "are you interested in the suns size", "are you looking for a history of solar eclipses"], ["are you looking for neil young tour dates", "which part of neil youngs life are you interested in", "are you looking for specific neil young songs", "do you want information on his death", "do you want to listen to his music", "do you want to find related artists", "do you want his biography", "do you want to find a certain song", "are you interested in neil youngs history", "are you looking for similar artists to neil young", "i can show you his songs lyrics would that be okay"], ["are you interested in tornado disasters", "are you wondering where tornadoes are more likely", "are you wondering how to spot a tornado", "are you interested in tornado safety", "are you looking for signs to expect", "are you looking for information on weather", "are you interested in how tornadoes are formed", "do you need to know what to do in case there is a tornado", "do you need to know the difference between a watch and a warning", "would you like historic information", "are there any specific media type on your mind shall i play a video of tornadoes"], ["are you looking for a specific web site", "would you like to know the countries in which bobcats are found", "are you interested in knowing where bobcats are located geographically", "are you interested in american bobcats", "are you in interested in the animal or the manufacturing company", "would you like to know specific products from the company bobcat", "are you interested in the evolution of bobcats", "what breed of bobcat are you looking for more information about", "are you interested in cultivated or wild bobcats", "would you like to know the habitat of the bobcat", "are you intereted in the diet of bobcats", "would you like to know the location of the headquarters of the company bobcat", "are you looking for a specific tractor model", "what would you like to know about bobcats", "would you like to learn about tractors", "would you like to know of any bobcats for sale"], ["are you looking for a musical keyboard or a computer keyboard", "would you like to know reviews for the best electronic keyboard", "would you like information on this years keyboards", "do you want to know about piano keys", "do you want to know about built in keyboards", "are you needing wireless or wired keyboard reviews", "do you just want to rated keyboards", "do yo want to know about keyboards internationally", "are you looking for places to buy keyboards", "are you interested in gaming keyboards", "are you interested in digital pianos", "are you interested in electronic keyboard reviews", "what type of keyboard reviews are you looking for", "what brand of keyboards are you looking for"], ["are you looking for current news about afghanistan", "do you want to know the history of afganistan", "do you want to know how many square miles afghanistan is", "what specific information about afghanistan are you looking for", "do you want to know the weather of a specific city in afghanistan", "are you looking for any specific details on the safety of afghanistan", "do you want to know about the wars fought in afghanistan", "are you looking for a map of afghanistan", "would you like historical information about afghanistan", "would you like to know where afghanistan is located", "would you like to know where afghanistan is on the map", "do you want to know the leaders of afghanistan"], ["would you like to know about woodworking", "are you asking about cannabis", "would you like to know the various diseases of the joints", "are you experiencing joint issues", "are you looking to buy joints", "are you suffering pain in one of your joints", "do you have joint pain", "are you looking for information on the purpose of joints", "are you speaking about the human body or a mechanical part", "what specific joint are you interested in", "what images of joints would you like to see", "are you referring to the joints you roll", "would you like to know how many joints the human body has", "would you like to know about home remedies for joint pain", "are you interested in human body joints classifications"], ["do you also need information about oceanic plates", "are yoiu looking for information on plate tectonics", "are you referencing earthquake activity", "which continental plates are you interested in", "are you looking for continental plate boundaries", "is there a certain area that you need information on specifically", "are you looking for a map of continental plates", "is there a specific representative you need information on thats written on the topic", "do you need an exact definition", "do you want to know how many continental plates there are", "do you need study information from professors", "are you looking for information on plate tectonics and the lithosphere", "is this the topic of a reseach paper that you may be writing"], ["are you looking for doctors that treat forearm pain", "there are some interesting articles on preventing forearm pain are you interested", "do you have forearm pain from typing", "does your forearm hurt from sports", "are you looking for any specific web pages", "are you looking for causes of forearm pain", "are you looking for a specific method to cure your forearm pain", "does your forearm hurt from twisting", "are you interested in the anatomy of forearms", "are you worried your forearm pain means you have a broken bone", "do you have forearm pain from lifting", "are you looking for treatments to forearm pain", "do you have forearm pain when extending your arm", "are you having forearm pain"], ["are you looking for specific information related to parents of children with ocd", "do you want to know the symptoms of ocd", "are you interested in ocd in children", "are you looking for documentaries of people who live with ocd", "are you looking for a definition of ocd", "would you like to know more about ocd", "are you looking for treatment for ocd", "do you want examples of ocd", "do you want to know more about the different types of ocd", "are you interested in ocd medications", "are you looking for a test to check for ocd"], ["are you looking for a specific web site", "are you looking for used car parts from a particular period of time", "do you want to recycle used car parts", "would you like to buy parts online or in person", "what type of car do you want parts for", "are you looking for used car parts from a particular manufacturer", "are you interested in heavy trucks part", "do you want to obtain used car parts", "would you like to pick parts yourself from a salvage yard", "would you like directions to the nearest parts store", "would you like to know maore about getting the best used car parts", "are you looking for used car parts for a particular model of car", "are you looking for the nearest junck yard", "do you want to sell used car parts", "are you interested in a specific part"], ["are you interested in the gt or the roadster", "are you interested in buying or selling an mgb", "are you looking for pictures of the mgb", "are you looking for what mgb stands for", "are you looking for mini gastric bypass surgery", "are you trying to find online reviews of mgb", "are you looking for more information about mgb", "are you looking for parts for the mgb", "are you looking to purchase an mgb", "are you looking for how to use mgb", "do you need the history of the mgb"], ["would you like to book a hotel i singapore", "would you like to know more about sir stamford raffles", "what kind of raffle are you interested in signing up for", "where would you like your raffle to take place", "are you interested in buying tickets to a raffle", "would you like to book a room in raffles hotel in dubai", "are you interested in raffles college of design", "are you interested in raffles hotels and resorts", "are you interested in raffles in which one can enter and win", "are you trying to look up the results of a raffle in your area", "are you planning to organize a raffle for a specific event", "are you looking for raffle tickets in your area to purchase", "are you interested in raffles tv series", "are you interested in aj raffles", "are you looking for a car raffles in your area", "are you interested in the movie raffles", "what category are you searching for raffles in"], ["do you want to know the country where rice was created", "do you need instructions for cooking rice", "do you want to know where rice originated", "what type of rice dish are you looking for", "do you want to know how rice is grown", "are you looking for rice university", "do you want to know how to harvest rice", "are you referring to a person named rice", "are you interested in a specific web page", "are you looking for a specific type of rice", "do you want to know how to cook with rice", "do you want to know the nutritional content of rice", "are you looking for recipes that include rice", "are you looking for a specific recipe"], ["do you want the population of south africa", "do you want to know how to get to south africa", "would you like the history of south africa", "do you want to know where south africa is", "are you interested in going to south africa", "would you like to know about south african food", "do you want to know who the preesident of south africa is", "are you moving to south africa", "would you like to know where south africa is on the map", "do you want a map of south africa", "would you like to see some pictures of south africa", "would you like to know the distance of south africa"], ["do you need sat study materials", "do you need information about the san antonio international airport", "would you like to know about the most recent satellite sent into orbit", "do you want more information about the sandy actors theater", "are you referring to saturday or the verb", "are you looking for the nearest sat testing location", "what would you like to schedule for saturday", "are you searching for your sat scores", "do you need any specific information about sat grades", "do you need more information about the sat test", "do you want to know the date for this saturday", "do you want to know who grades your sats", "are you interested in a specific web page", "do you want to register to take the sat test", "do you want to take a sat prep class"], ["are you looking for a company which provides internet services", "are you looking for a specific kind of maps and images", "are you inquiring about satellite tv", "are you referring to satellite imagery on google maps", "are you looking for history of the satellite radio systems", "do you want to know about a satellite receivers or dishes", "are you referring to the company called satellite industries inc", "do you want to figure out the benefits of satellite tv over cable tv", "do you want to know more about the technology behind satellites", "do you want to know about natural or artificial satellites", "would you like to know more about satellite tv history", "would you like the definition of the word satellite", "what kind of satellite are you looking for", "are you interested in learning more about satellite phones or radio", "are you talking about a spacecraft or a song"], ["would you like to know which celebrity makes the biggest average charitable donation", "are you interested in a specific charity", "would you like to know the average charitable donation based on income level in 2019", "would you like to read the most recent articles about the average charitable donation", "would you like information about the average charitable donation broken down by year", "are you looking for a comparison graph of average charitable donations", "are you curious about what an appropriate average charitable donation", "do you want to know how much the average charitable donation is", "are you looking for the average charitable donation by city state or county", "would you be interested in local regional national or international news regarding the average charitable donation", "do you want to know how much a government officials average charitable donation is", "do you want to know which country has paid the highest average charitable donation amount"], ["are you looking for tourist attractions in madagascar", "would you like to know about madagascar exports", "would you like to know what plants are native to madagascar", "would you like to know what they are known for exporting", "would you like to know what animals are native to madagascar", "are you looking for what they are producing the most", "are you referring to the movie series or the country", "would you like to know about madagascar economy", "do you want to know what madagascar is famouss for", "would you like a list of fun facts about madagascar", "are you looking for things to do while in madagascar", "do you want to know what food they are famouss for"], ["are you looking for activities that can be done inside or outside", "are you interested in easy earth day activities", "are you looking for activities to be done in a classroom", "are you interested in crafts or worksheets", "what are the ages of the children you want to find activities for", "are you looking for activities that involve plants", "are you looking for craft ideas for kids on earth day", "are you searching for online earth day activities", "do you want to know more about kid safe earth day activities", "would you like information on free earth day activities", "would you like activities that focus on the theme for this years earth day", "what age of kid would be completing the activity"], ["which party do you want results from", "is there a specific state that you would like the results", "would you like to see the final electoral college results or the entire process", "do you want to know the candidates for the 2008 results as well", "are you looking for only the 2008 results", "would you like to know the vote counts for a specific candidate", "would you like a graph to be included with the results", "do you want to hear a specific demographic from the results", "who is the party candidate you would like to know more results", "can i give the percentages for a specific party", "do you want results from both parties", "would you like a list of withdrawn candidates"], ["do you want to know what the usda food pyramid is", "would you like to learn about how the usda food pyramid was created", "do you want to learn more about the usda food pyramid", "do you want to know why the food pyramid was created", "would you like to see a picture of the usda food pyramid", "are you concerned if the food pyramid is out of date", "are you looking for a food list for the usda food pyramid", "are you interested in the science behind the usda food pyramid", "are you interested in the history of the usda food pyramid", "do you want to know if the food pyramid still in use"], ["how many ingredients do you want to use for this soup", "are you looking for restaurants that are selling chicken soup from scratch", "are you looking for all the ingredients for chicken soup", "which type of chicken soup would you like to make", "are you looking for reviews of a specific chicken soup recipe from scratch", "will you be making this at home or at a commercial kitchen", "would you like the instructions for making chicken soup from scratch", "do you want a fast recipe or one that takes some time to make", "are you looking for chicken soup made from scratch by famouss chefs"], ["do you want to hear the songs while you read the lyrics", "are you searching for the chorus of i will survive", "which verse of the song i will survive do you want to know", "are you referring to the song i will survive", "do you want to sing along with the lyrics", "do you want to know more songs from gloria gaynor", "do you want the lyrics on paper or on video", "do you want the lyrics to the chorus", "do you want to know the meaning of the song i will survive", "do you want the lyrics to the whole song", "do you want to know who sings i will survive", "do you want to see other songs about survival"], ["do you want to find out what the hawaiian volcano observatories have been monitoring", "did you want to know where the hawaiian volcano observatories are located", "do you want to know what specific purposes the observatories serve", "do you want to know how long the hawaiian volcano observatories has been monitoring kilauea", "would you like to know the histories of the observatories", "are you looking for activity summeries of the volcanoes that the hawaiian volcano observatories is currently watching", "are you interested in knowng the earthquake intensities recorded by the hawaiian volcano observatories", "are you looking for a specific observatory", "would you like to know where the observatories are located", "are you interested in what hawaiian volcano observatories do", "do you want a list of all the volcano observatories in hawaii", "are you doing research on volcano observatories"], ["do you want to know more about the books proverbs and galatians in which the seven deadly sins are mentioned", "do you want to know more about one of the seven deadly sins", "do you mean the traditional ones or the seven deadly sins of something else", "do you want to know the meaning of the seven deadly sins", "do you want their names", "would you like to know where in the bible the seven deadly sins are mentioned", "which of the seven deadly sins do you want to know more about", "would you like their names or their meaning", "is there one in particular you are interested in", "did you want to know the order of the seven deadly sins", "according to anima the bible or what other source"], ["would you like stories about the national guard in hurricane irene in manville nj", "would you like videos about floods associated with hurricane irene", "do you want to know the timeline of flooding in manville nj because of hurricane irene", "what date range are you interested in", "are you looking for before or after results of flooding in manville nj due to hurricane irene", "which area of manville nj floods are you most interested in", "are you trying to buy flood insurance", "are you seeking the most andor least affected areas of flooding during irene in manville nj", "are your referring to damages sustained due to hurrican irene flooding in manville nj", "are you seeking random facts about manville nj during hurricane irene", "are you looking for information on flood damage", "would you like news or social media posts on hurricane irene"], ["would you like to know first symptoms", "do you want to know if mad cow disease has a cure", "which symptoms would you like to know about", "did you want to know how to treat mad cow disease", "are you interested in the signs one may show for mad cow disease", "is there a particular gender of human", "which part of the body are you interested in", "would you like to hear about treatments", "what symptoms of mad cow are your most interested in", "do you want to know if memory loss is a sign of mad cow disease", "do you want to know early signs", "do you want to know what causes mad cow disease"], ["do you want to see a list of frank lloyd wrights most famouss works", "would you like to know about frank lloyd wrights family", "want to see a list of vacation destinations that include architecture designed by frank lloyd wright", "would you like to know where frank lloyd wright did most of his work", "would you like to read some of frank lloyd wrights writings", "would you like a list of photographs commonly associated with biographies involving frank lloyd wright", "would you like to know where frank lloyd wright was born", "are you looking for frank lloyd wrights family tree", "are you interested in how frank lloyd wright became an architect", "would you like to see a list of frank lloyd wrights most notable works", "would you like a list of the best biographies for frank lloyd wright"], ["what would you like to know about the collaborative nature of wiki", "is a rich text editor something you are familiar with", "how much do you know about markup language on wiki", "what wiki site are you interested in", "do you want to know how wiki works", "would you like information about creating a wiki", "what would you like to know about wiki software", "are you interested in how wiki is used", "what would you like to know about ward cunningham inventor of th wiki", "would would you like to know about the most popular wikibased website"], ["are you interested in learning about the consequences of south carolinas battles on the overall war", "would you like to know how many battles were fought in south carolina", "do you want to know which civil war battles took place in south carolina", "which military generals fought in the battles your most interested in", "are you more interested in battles won by the union or the confederacy", "are you interested in civil war battle memorials and other structures in south carolina", "would you like to know which civil war battle sites can be visited in south carolina", "are you interested in the outcomes of the civil war battles in south carolina", "would you like to know how south carolina was affected by the battles fought on its ground", "do you want to know how civilians supported the battles in south carolina", "would you like to see a picture of a map of the civil war battle sites in south carolina", "are you interested in when the civil war battles in south carolina took place"], ["would you like to see a chart to help you identify spider bites", "would you like to see pictures to help you identify spider bites", "are you looking to find out what type of spider bit you", "what country spider bites are you interested in identifying", "are you looking for the difference between insect bites and spider bites", "would you like to see pictures to help you identify types of spider bites", "do you want to know how to treat different spider bites", "would you like to know the symptoms associated with bites from different kinds of spider", "are you interested in spider bite symptoms", "are you concerned about whether to go to the hispital for a spider bite", "would you like to know if your spider bite requires a doctor hispital visit", "would you like to know which spider bites you swould be worried about"], ["are you looking for evolution of people", "does the evidence have to be factual", "what kind of evidence are you looking for", "would you like the evolution of men or women", "are you interested in the history of theories of evolution", "what kind of medium do you want this information to be in", "is there any specific thing that evolves that you want to learn more about its evolution", "are you looking for scientific evidence", "how complex of an answer are you hoping to find", "are you looking for evidence of the current accepted theory of evolution", "are you looking for teaching resources concerning evolution", "are you asking about the evolution of plants or animals"], ["are you interested in alabama towns named after tribes", "are you looking for a map", "are you interested in all tribes formerly living in alabama or just one tribe", "are you interested in where in alabama indian tribes lived", "is there a specific time period you are interested in", "are you interested in a specific tribe", "would you like a history of the cherokee tribe", "are you looking for information on the cherokee tribe", "would you like current events stories about the cherokee tribe", "are you referring to an indian tribe", "would you like a list of news articles"], ["would you like to know about symptoms of a heart attack in a pet", "would you like to know symptoms that are concerning enough that you swould go to the emergency department", "would you like to know more about chest pain", "would you like to know symptoms that are common in men or common in women", "would you like to know about typical or atypical symptoms of heart attack"], ["do you want to know how to navigate to your history on your browser", "did you want to search for a specific site", "did you want to erase your history", "on which device are you looking for history", "how far back in time would you like to see from your history", "would you also like to delete your history", "are you concerned about other people seeing your history", "which days history did you want to see", "how much of your history did you want to see", "would you like history from this device alone or would you like history from all devices", "do you want to know how to hide your history from others"], ["are you a collector", "which country do you want to find mushrooms in", "are you interested in any other type of mushroom", "do you have a specific state in mind to search for mushrooms", "is there a mileage range you are willing to travel to search for mushrooms", "are you looking to eat the mushrooms", "what type of equipment do you have to look for them", "are they poisonous", "what are you trying to do with the mushrooms", "what region are you looking in", "what time of year are you looking for mushrooms", "which portion of the united states are you looking at"], ["do you want to know how to get prescribed the most common schizophrenic drug", "are you inquiring which typical or uncommon drug is used", "are you interested in the side effects of the common schizophrenia drugs", "what happens when common schizophrenia drugs are disconinued", "are you interested in knowng what common drugs can treat schizophrenia", "do you want the generic types or name brand", "are you wanting to find out side effects of common schizophrenia drugs", "did you want to know the medication names of common schizophrenia drugs", "are you wanting to know the most commonly used drugs", "do you want to know the types of prescribed antipsychotic drugs", "do you want to know the cost of the commonly used drug", "for which year did you want to find out what the common schizophrenia drugs are"], ["do you want to recycle lead acid batteries in person or by mail", "do you want to learn how to recycle lead acid batteries", "are you interested in the recycling process for lead acid batteries", "would you like to recycle lead acid batteries for money or for free", "what was the lead acid battery you want to recycle used for", "do you want to find a nearby recycling center that can accept thise batteries", "would you like to know about environmental benefits of sustainable lead acid battery recycling", "which type of lead acid batteries do you want to recycle", "are you interested to learn how many lead acid batteries are recycled", "do you want to know if it is possible to recycle lead acid batteries", "would you like a map of nearby locations where you can recycle lead acid batteries", "are you interested in how lead acid batteries are recycled"], ["are you looking to buy cheap internet", "are you wondering which provider has the cheapest internet", "are you wondering who used cheap internet", "are you wondering how to reduce your internet bill", "are you interested in finding cheap items on the internet", "do you already have a phone service", "are you looking for any bundles or deals", "are you looking for information on any specific internet technology", "are you wondering where cheap internet is", "what companies have the lowestcost internet service", "are you interested in lowcost internet providers", "or maybe free internet", "how do you know if your internet service is inexpensive", "are you upset by the quality of your internet service"], ["would you like to see examples of walkers impact on current hair styling", "do you want to know what madam cj walker is famous for", "would you like to see more early africanamerican entrepeneurs", "would you like historical information on madam cj walker", "would you like to know about walkers method of perming hair", "would you like to know the birthplace of madam cj walker", "would you like to know about madam cj walkers products", "do you want more information on the history of madam cj walker", "would you like to see facts about madam cj walkers early life", "are you looking for sarah breedlove", "are you looking for any specific information about the business she started", "are you looking for her whereabouts", "do you want to know what madam cj walker invented"], ["are you interested in a calculator for child support payments", "are you interested in child support resources", "are you interested in getting details on finding a lawyer for child support", "are you interested in indiana child support", "do you owe child support in indiana", "which counties law would you like clarification on", "do you want to know about a specific indiana child support law", "would you like details on how to pay child support", "would you like a list of forms for processing child support claims", "are you seeking support of a child in indiana", "do you want wording of child support laws", "do you pay child support in indiana"], ["would you like to know where the test is used in", "do you need instructions to do the test", "do you want to purchase a box to measure with", "do you want to know how to perform this test", "do you want to know what is considered a good score", "do you want to know who should take the test", "are you looking for information on how its scored", "are you trying to determine how well you did", "do you want to know other related tests", "do you want to know the purpose of the test", "do you want general information about the test"], ["are you wondering when uranus was discovered", "how many facts do you want", "do you want to know how old it is estimated to be", "is there a specific type of fact that you want to know", "are you wondering the size of uranus", "are you wondering what uranus is made of", "are there any specific details that you are trying to find out", "are you wondering what probe visited uranus", "do you want to know the size of the planet", "are you wondering the temperature of uranus", "are you looking for learning material for school", "do you want to read an encyclopedia entry on uranus"], ["would you like the instructions for electronic skeet shoot", "would you like to know different types of it", "would you like to see the retailers selling it", "what specific type of electronic skeet shoot are you interested in", "are you wanting to know what it is", "do you want to know what electronic skeet shoot is", "are you needing to know what its used for", "do you want to know how to use it", "what brand of electronic skeet shoot are you inquiring about", "are you looking for reviews related to it", "are you interested to see images of it", "are you interested where to find one", "would you like find out where you can play electronic skeet shoot", "what would you like to know about electronic skeet shoot", "would you wanting to know how to set one up", "are you looking for product recalls"], ["would you like me to contact them for you", "are you interested in how much a patrol officer makes per year", "are you interested in knowing the avergae salary of an employee of the tennessee highway patrol", "are you interested to fill a survey for them", "do you want to know how many employees work for the tn highway patrol", "do you want to know if the tennessee highway patrol has reported any accidents", "do you need the number of patrols cars used by the tn highway patrol", "would you like to know how many tickets they right ever year", "did you want to be informed as to whre the tennesse highway patrol academy is located", "would you like to know more about their responsibilities", "did you want to know what the tenessee highway patrol cars look like", "are you looking for a specific web site", "are you curious about the employment opportunies at the tennesse highway patrol", "are you interested in knowing where the tennesse high patrol check points", "are you interested in who is in charge of the tn highway patrol"], ["are you interested in any specific rules", "would you like to see if your employer offers 403b resources", "are you looking for withdrawal rules for 403b plan", "are you trying to find out the difference between 401k and 403b", "would you like to find retirement financial advisors", "would you like to see resources for retirement investing", "are you looking for the information how 403b plan works", "would you like to see the difference between a 403b and 401k account", "do you need 403b calculator", "would you like to know more about a 403b retirement account", "what year do you want to begin contributing 403b", "would you like to see alternative retirement accounts", "do need to see any specific information about 403b eligibility", "do you want to know 403b contribution limits in 2018"], ["do you want to know the location of the last supper painting", "woud you like to know about last supper reproductions", "are you interested in who painted the last supper painting", "do you want to know where you can view the last supper painting", "would you like to purchase tickets to view the painting in milan", "would you like to see a picture of the painting", "do you need directions to see the last supper painting", "do you want to know how much the last supper painting is worth", "are you interested in the history of the last supper painting", "do you want a book about the last supper painting", "what aspect of the last supper painting are you interested in", "do you want to know why leonardo davinci painted the last supper painting", "what is your purpose for searching for the last supper painting", "do you want to know who painted the last supper painting"], ["are you trying to find out the rating of the beatles rock band game", "would you like information on a particular band member", "are you interested in learning the history of the beatles", "are you looking to find out about the albums of the beatles", "are you trying to purchase the beatles rock band game", "do you want a list of their songs", "would you like to know of upcoming concert dates", "would you like a history of the band", "are you looking to find out what game platforms you can play the beatles rock bank game on", "are you interested in a specifc song from the beatles", "are you interested in awards received by the band", "do you want to buy their music"], ["do you want to learn how to make furniture", "do you need any specific tips on decoration", "are you looking for dining room furniture", "are you looking for living room furniture", "are you looking for bedroom furniture", "are you looking for furniture for a specific room", "are you looking for kitchen furniture", "are you interesting in buying furniture", "do you need information about furniture arrangement", "are you looking for information about any specific decoration technique", "have you got any specific question regarding furniture size", "do you want to buy it online", "what type of furniture are you looking for", "do you want to sell furniture"], ["do you want to know how poker tournaments are played", "do you want to find local tournaments near you", "are you looking for the world series of poker", "are you interested in learning how to play poker", "do you want to know who won the last world series of poker", "which poker tournament are you interested in knowing more about", "would you like a schedule of poker tournaments", "where would you like to find poker tournaments", "do you want to watch a tournament online", "do you want to play in online poker tournaments"], ["are you trying to change scooter oil", "are you looking for locations that have the scooters", "would you like to explore more on scooters", "are you trying to build a scooter", "do you need a retailer near you", "will this be for an adult or child", "are you looking to rent a scooter", "would you like to purchase one or rent it", "are you looking to buy a scooter", "is this for mobility or fun", "are you interested in scooter laws", "there are some cool deals available shall i show them", "do you have a specific brand name on your mind"], ["are you looking for a list of movies ron howard directed", "are you tring to find movies and tv shows where ron howard was an actor", "do you want to know more about ron howards directing career", "are you interested in ron howards personal life", "are you interested in when ron howard was younger or his older work", "do you want to know how old ron howard is", "are you trying to find films that ron howard directed", "are you trying to compare different ron howard movies", "would you like to know how many movies ron howard has directed", "are you looking for upcoming movies by ron howard", "are you interested in ron howards life story and career highlights", "would you want to know about ron howards acting career", "what would you like to know about his family", "are you looking for ron howard biographies"], ["would you like to become a paralegal", "do you know anything about the law", "are you looking for paralegal job opportunities", "do you want a list of firms that are currently hiring paralegals", "do you want to know the responsibilities of a paralegal", "do you want to know colleges in your area where you can study to be a paralegal", "are you looking for a specific web page", "would you like to know more about the duties of a paralegal", "are you looking for specific courses", "do you want to know the average annual salary for paralegals", "do you want to know the qualifications necessary to become a paralegal", "do you want to learn about the law", "do you watch lawbased television", "are you interested in law school", "do you want a paralegal internship"], ["price of a pork tenderloin", "do you need to cook a pork tenderloin", "would you like to marinate your pork tenderloin", "do you want to know where pork tenderloin comes from", "are you purchasing pork tenderloin today", "would you like to see pork tenderloin recipes", "would you like to see the cooking temperature of pork tenderloin", "would you like to make a rub for pork tenderloin", "how would you like to cook your pork tenderloin", "do you need to know how long to cook pork tenderloin", "would you like to know where to purchase a pork tenderloin", "are you interested in a pork recipe", "would you like to know where pork tenderloin comes from in a pig"], ["are you looking to purchase old or collector coins", "do you want to sell old coins", "do you want pictures of old coins", "did you find them", "do you want to know the value of old coins", "any tutorials would interest you", "is there a coin dealer near you", "would you like information on the worth of coins", "do you want to buy old coins", "are you interested in specific old coins", "is there a specific type of coin that interests you"], ["are you looking for patches", "are you looking for information on how to quit smoking", "are you looking for side effects of quitting smoking", "are you wondering how other people have quit smoking", "are you wondering if it is hard to quit smoking", "do you want information on how many people successfully quit smoking", "are you having trouble quitting somking", "would you like to know about the benefits of quitting smoking", "are you looking for smoking alternative products", "are you looking for doctors that can help you quit smoking", "are you trying to quit smoking"], ["would you like to know about any specific acts", "would you like to know what happened during the civil rights movement", "do you want to know about specific key people", "do you want to know if there are current civil rights movements", "would you like to know when the civil rights movement began", "do you want to know who the people were who started the civil rights movement", "what would you like to know about the civil right movement", "do you want to know who started the movement", "is there any specific historical movement on your mind", "do you want the history of the civil right movement", "are you interested in knowing what started the civil rights movement", "which countrys civil rights movement are you interested in"], ["do you want a condo for vacation or to live in", "are you looking to buy or lease", "what is your price range", "are you planning to live there or are you looking for an investment property", "do you want to rent or buy a condo", "do you want to be on the beach", "what area is florida are you interested in", "what other features are you looking for in a condo", "how many bedrooms do you want", "are you interested in condos in sale", "are you looking for a specific price range", "are you interested in any specific city in florida"], ["do you want a designer dog", "are you interested in a specific designer dog breed", "do you want to know unusual designer dog breeds", "will you like to know the most popular dog", "do you want to know how much designer dog breeds cost", "do you want to know where to buy a designer dog breed", "do you want to know what a designer dog breed is", "are you interested in a puppy", "do you want to know what the most popular designer dog breeds there are", "do you need information on any specific hybrids", "do you want to know if designer dog breeds are healthier than purebreds", "do you want to know what are cosidered designer dog breeds", "would you like to see some pictures of designer dog breeds", "are you interested in the price of the designer dog breed", "are you looking for a list of the top designer dog breeds"], ["do you need a map", "do you need a taxi", "are you looking for events", "do you need a hotel", "do you want to know the address", "are you looking for the convention center in florida", "are you looking for things to do around that area", "do you want to know the events going on here", "are you planning any events there", "do you want to know a phone number to call", "do you want to know their hours of operation"], ["do you want to know how an indexed annuity works", "do you want to know about companies that provide indexed annuities", "do you want to know if an indexed annuity a good investment", "do you want information about fees for indexed annuities", "do you want more information about what an indexed annuity is", "would you like reasons not to invest in an indexed annuity", "are you interested in finding out the rates for indexed annutiies", "do you know what an indexed annuity is", "would you like to know the advantages and disadvantages of a indexed annuity", "are you interested in finding out the difference between an indexed and variable annuity", "would you like to purchase a indexed annuity", "do you want to calculate how much an indexed annuity would provide", "do you want to know how much an indexed annuity would cost", "are you considering purchasing an indexed annuity"], ["do you want to know what their jurisdiction is", "are you looking for a specific web page", "do you want a phone number to call", "are you interested in what their job duties are", "do you want to apply for a job here", "do you want to know how to become one", "do you want to report an incident", "do you want to know where their headquarters is located", "would you like to know how many there are", "do you want to know information about the patrol", "are you trying to find out if they can use deadly force"], ["are you interested in moth life cycle", "do you need any specific information for controlling moths", "are you wondering what moths eat", "are you wondering where to find moths", "are you interested in moth biology", "do you need to see a picture of moth", "are you interested in what draws a moth to flame", "are you looking to fix a moth infestation", "are you looking for luna moths", "do you need to identify a moth", "are you really reffering to mothra", "which type of moth are you looking for", "would you like to know how to catch moths"], ["are you searching for a specific airport", "are you looking for more info on air travel in general or a specific flight", "do you want information on international travel or domestic travel", "do you need to find out about airport weather delays", "where are you looking to travel to", "would you like to know more about carryon luggage rules", "would you like to know more about checked baggages rules", "would you like to book a flight", "do you need more information about different kinds of air travel", "are you interested in the history of air travel", "would you like more info on tsa guidelines", "would you like to hear air travel info in the news", "are you trying to find an airline", "what dates are you planning on traveiing"], ["do you need information in different types that can be made", "is your request related to raised garden beds", "do you need information on best climate for specific plants", "do you need instructions on how best products to use for growth", "is information needed on best ways to care for the garden once planted", "do you need information on materials needed", "do you want to buy a book about raised gardens", "are you looking for any specific photos", "what type of information about raised gardens are you looking for", "is this in reference to flowers or vegetables", "do you want to take a class about raised gardens", "do you want to know what to plant in a raised garden", "what specific supply would you like to buy for your raised garden", "do you want to know how to create a raised garden", "do you want to buy raised garden supplies"], ["would you like to know more about dieting products for weight loss", "are you looking for dieting that involves no medications", "do you need anything specific in relation to counting calories you consume daily", "are you searching for dieting pills", "would you like to read about different types of diet pills", "are you interested in reading more about the health benefits of dieting", "how fast would you like to lose weight", "will the dieting be in combination with exercise or weight training", "are you interested in reading some inspirational quotations about dieting", "do you want to learn about the history of dieting", "how much weight do you want to lose while dieting", "are you looking for dieting tips", "would you like a list of area doctors that can give professional advice on dieting", "what kinds of specialized diets are you interested in", "do you want to know if dieting is safe"], ["are you looking for transit routes to oakland from bart sf", "do you need information on how to ride the bart", "are you looking for a map of the bart system", "what information do you need about bart sf", "are you taking the bart from san francisco international airport", "are you looking for contact info in relation to bart sf", "are you looking for bart travel schedules", "are you looking for transit routes to berkeley from bart sf", "for what route are you seeking information", "are you interested in bart sf the company", "are you looking for a specific web site", "do you need to purchase a bart ticket", "are you looking for transit routes to walnut creek from bart sf"], ["do you wish to know how music videos started", "are you interested in the invention of modern music or the beginning of all music", "would you like to know about inventions related to music", "is there any specific music genre you are interested in", "do you want the name of one person", "are you interested in musical notes and their origins", "do you want to know what kind of music was the first", "are you interested in music streaming", "are you looking for who invented the first instruments", "do you want information related to music notation and written music", "do you want to know the first song ever recorded", "are you looking for the history of classical music", "do you want information on the person who invented music"], ["would you like to buy the dvd of er tv show", "are you interested in summaries of episodes of er tv show", "are you looking for a website to watch er tv show online", "do you want to know what channel er tv show is on", "what type of information about the show do you need", "do you want to know awards er has won", "do you want to know who the main actor is in er tv show", "are you looking for the featured music on the er tv show", "do you want to know what time er tv show is on", "do you want to watch er tv show", "are you interested on when er tv show started", "are you looking for a list of er episodes", "are you looking for ways to watch er", "what season of er are you interested in", "are you looking for a list of er actors"], ["do you neeed dry wall products", "are you referring to the vietnam veterans memorial wall", "are you interested in downloading the album the wall", "are you looking to buy the album the wall online", "are you interested in building a home", "are you referring to the nbc television show", "are you interested in a specific part of a home", "are you referring to the wall proposed by donald trump or the wall by pink floyd", "would you like to know the rules of the wall game show", "do you want to know the news about the border wall", "are you looking for a specific web site", "do you want to contribute to the gofundme campaign to fund the wall", "are you interested in hearing facts about the proposed border wall", "are you looking for a specific movie"], ["are you referring to titan the moon of saturn", "are you referring to the greek god or the pc", "do you want to know about the tennessee titans", "are you referring to the titans from titanfall", "are you referring to the watch brand", "would you like to see the a specific titan", "are you looking for the latest tennessee titans scores", "are you referring to a specific vehicle", "do you want to learn more about the show titans", "are you looking for the computer part", "are you interested in a specific titan", "are you referring to the monster from the final fantasy series", "are you looking to get more information about titan machinery", "are you interested in a specific web page", "are you interested in learning more about mythological titans"], ["do you want reviews of the les miserables concert", "would you like low rated reviews", "do you want reviews of les miserables from london", "do you want reviews of the les miserables tv series", "do you want reviews of the les miserables book", "do you want reviews of les miserables from pbs", "do you want good reviews or bad reviews", "would you want movie reviews", "do you want reviews of the les miserables movie", "would you like book reviews", "do you mean the book or the movie", "would you like highly rated reviews"], ["what brand of dark chocolate are you referring to", "what specific brand of dark chocolate are you interested in", "do you want to know how much dark chocolate you swould have for a day", "were you looking for prices of dark chocolate", "do you think of the reason to have dark chocolate", "did you need the nutritional value for dark chocolate", "what percentage of dark chocolate in one serving that you would like to know", "do you want to know where dark chocolate is made", "are you interested in the different candles dark chocolate is made into", "do you want to know the origins of dark chocolate", "are you interested only the list of health benefits of dark chocolate", "are you trying to loss weight"], ["do you want to know what political party george bush sr is", "would you like to know the major events of george bush srs presidency", "are you interested in what george bush srs policies were", "would you like to watch a debate with george bush sr", "would you like to know about george bush srs family", "are you interested in who george bush srs son is", "are you interested in what george bush sr did after being president", "would you like to know what george bush sr did before being president", "are you interested in the 1992 presidential election george bush sr was part of", "do you want to know the most important events of george bush srs life", "would you like to know how long george bush sr was president", "would you like to know where george bush sr went to school"], ["are you interested in the full names of all of the past presidents of the united states", "do you want to know what middle name is the most common for presidents", "are you interested in the middle name of the current vice president of the united states", "are you interested in the full name of the current president of the united states", "do you want the middle names of all of the presidents", "are you interested in presidential middle names for the past presidents of the united states", "do you want to know the middle name for a specific president of the united states", "did you want the middle name of a particular president", "are you interested in finding out the middle name of the most recent presidents", "do you want to know the middle name of the current president of the united states", "are you looking to find out unique middle names that presidents have had", "are you looking for the middle names of the early presidents"], ["would remedies using honey be what you are looking for", "are you interested in making your own medicine to cure a sore throat", "are you interested in remedies that are proven effective for treating a sore throat", "do you want to know if these remedies actually work", "are you interested in historical medical treatment for sore throats", "are you looking for homeopathic remedies for a sore throat", "do you want to know if doctors agree with a particular folk remedy for curing a sore throat", "are you interested in the folk remedies from a specific countries", "are you looking for natural remedies for a sore throat", "do you want to learn about home health care when you have a sore throat", "do you want to know if a home remedy will work for everyone", "are you interested in folk remedies from a specific era"], ["are you looking for a video tutorial", "are you looking for a way to do this with pictures", "are you looking for a video tutorial on how this is done", "do you want to know how to tie a full windsor knot", "do you want stepbystep directions", "are you looking for a way to tie this knot quickly", "are you looking for a way to make this into a neck tie", "are you looking for step by step instructions on how to do this", "would you like to know ways to tie a tie", "what type of instructions are you looking for", "are you looking to do this with a specific material", "are you interested in different knot tying techniques"], ["would you like the location of the ritz carlton lake las vegas", "are you looking for directions to the ritz carlton in las vegas", "do you want historical information on the ritz carlton lake las vegas", "are you looking for any specific games to play there", "would you like to know the capacity of ritz carlton lake las vegas", "are you wanting a room at the ritz carlton in las vegas", "are you wondering where the ritz carlton in las vegas is located", "do you need a reservation at the ritz carlton in las vegas", "would you like to read some reviews of the ritz carlton lake las vegas", "are you looking for the closest lake to the ritz carlton in las vegas", "are you wanting the rates for the ritz carlton in las vegas", "would you like the history of ritz carlton lake las vegas", "are you looking for a specific web site", "would you like to know where ritz carlton lake las vegas is on a map"], ["would you like to review universal animal cuts", "did you want to know if it was effective for different levels of weight", "would you like to purchase universal animal cuts", "were you interested in the side effects of universal animal cuts", "would you like to see comparable products to universal animal cuts", "why are you looking to add supplements to your diet", "were you interested in how much weight people lost", "were you wondering about how universal animal cuts works", "did you want to know if the price was worth it", "would you like to see the top reviews for universal animal cuts", "did universal animal cuts work for you", "did you want to know if anyone near you has tried it", "would you like to see the lowest reviews for universal animal cuts"], ["are you looking for a specific part of missouri", "can i help you find something on a map", "do you want to know about the crime rate in cass county missouri", "are you interested in a list of homes for sale in cass county", "do you want to know about the schools in cass county missouri", "would you like to know more about the city", "is there any important documents youre trying to access", "are you looking for places to eat in cass county missouri", "is there any specific information that you are looking for", "which neighborhood in cass county are you interested in", "are you looking for government service", "do you have travel plans", "there are some interesting historical facts about cass county shall i show them to you", "which part of cass county are you referring to"], ["do you wish to know the location of native american houses", "do you want to know what adobe indian houses are made out of", "do you want to know where to find adobe indian houses", "do you want information about the construction of adobe houses", "do you need any specific information about people who resided in adobe houses", "are you going to purchase any specific product related to your search", "do you want to know about pueblo hopi or american indian houses", "do you want to learn how an adobe indian house is made", "are you looking for pictures of adobe indian houses", "what type of adobe indian house are you looking for", "are you looking for a tour of adobe indian houses"], ["are you looking for specific information about von willebrand disease", "which animal are you interested in knowing about in regards to von willebrand disease", "what person with von willebrand disease do you want to know about", "would you like to learn about the symptoms of von willebrand disease", "do you want to know how von willebrand disease is treated", "what kind of information about von willebrand disease do you want to see", "do you want information about von willebrand disease in dogs", "are you interested in the types of von willebrand disease", "which type of von willebrand disease do you want information about", "are you interested in learning about treatments for von willebrand disease", "do you want to know about the cause of von willebrand disease"], ["are you interested in a desciption of aytypical squamous cells", "do you want to learn about cervical cancer", "would you like to know about treatment for atypical squamous cells", "do you want to learn about atypical squamous cells in a pap smear", "would you like the definition of atypical squamous cells", "are you interested in atypical squamous cells in a test result", "do you want to see how common it it", "would you like to know if there is a cure", "are you interested in atypical squamous cells in urine", "would you like to know the chance of getting atypical squamous cells", "do you want to see a picture of atypical squamous cells"], ["would you like to learn more about the declaration of independence", "would you like to know the gettysburg address", "would you like to learn about the origin of that quote", "would you like to know more about the declaration of independence", "would you like to learn more about thomas jefferson", "what else do you want to learn about the quote", "which use of that quote are you interested in", "are you trying to look up a speech", "who are you interested in learning about who has that quote attributed to them", "are you looking for declaration of independence at the national archives", "would you like to know its interpretation by the us supreme court", "would you like to know more about the author", "would you like to learn about the author of that quote", "are you trying to look up the constitution"], ["are you specifically interested in the paper published in denver co", "are you interested in news archives", "what type of news are you interested in", "would you like to see a list of reporters of the rocky mountain news", "do you want to watch news videos or read the news", "are you looking for information regarding the rocky mountain range", "are you interested inn information about the national park", "do you want to incude both canadian and us news sources", "do you want to read geology of the mountain range", "do you want historical or recent news events", "are you talking about news in colorado", "are you looking for a specific web site", "who do you want to find news reported by", "would you like to read recent news about the rocky mountain news", "what time period are you looking for news coverage"], ["are you looking for a specific form", "do you want to read articles about the tax rate or know the tax rate percentage", "what classification would you like to know the tax rate for", "would you like know who collects illinois state tax", "would you like to know when the illinois state tax is due", "which county do you live in", "do you want to know what the illinois state tax rate is", "may i tell you how much the state income tax in illinois is", "do you want to know where your refund is or know the tax rate", "for which year would you like to know the illinois state tax", "are you interested in how the illinois state tax is determined", "what info about the state tax are you looking for", "do you want to get helping completing your illinois state tax return", "are you interested in how to pay your illinois state tax"], ["what type of hobby are you looking for", "is this a hobby for an adult", "do you want to know hours of operation", "will tihs hobby involve excercise equipment", "are you looking for a specific hobby store", "are you looking for coupons", "do you want stores with physical locations or online stores", "what kind of train are you looking for", "is this a hobby where anyone can build things", "are you looking for stores that are currently open", "what location do you want to find a hobby store in", "why type of hobby arts and crafts or sports", "are you looking for a radiocontrolled plane", "is this for a school craft or play", "is this a hobby for child", "are you looking for hobby stores located in maryland"], ["would you like information about their breeding", "are you curious about the size", "would you like to know about the current population numbers of blue throated hummingbirds", "are you interested in learning about where blue throated hummingbirds live", "would you like to know where it originates from", "would you like to know where you can find them", "do you want to learn more about how blue throated hummingbirds mate", "are you looking for any specific photos", "do you want to know what they look like", "would you like to know anything specific related to it life style", "do you want to find them in mexico or in the us", "would you like to learn about how fast blue throated hummingbirds are", "what similar species are you looking for", "would you like to learn about how blue throated hummingbirds eat", "do you want to know if blue throated hummingbirds are nice", "are you wanting to know its scientific name"], ["are you interested in a coding bootcamp", "are you interested in coding courses online", "are you interested in programming courses for children", "are you looking for nearby coding classes", "are you looking to see how much computer programming lessons cost", "are you looking for a job in computer programming", "are you looking for information on different computer programming languages", "do you need any specific information about its job market", "are you looking for computer programming schools near you", "are you interested in the history of computer programming", "do you any specific information about computer science degree program", "do you want to know how to do computer programming", "are you looking for information on jobs"], ["do you want specific or general details on battles", "are you looking for large battles", "are you looking for the american civil war", "are you looking for a specific battle", "are you looking for a confederate victory", "do you want to know how many people were killed", "do you want to know a history of all battles in the war", "are you looking for a union victory", "is there a certain state that you are interested in seeing battles for", "do you need a list of civil war battles", "are you looking for a specific movie"], ["do you want examples of rock art", "would you like to know anything specific about rock music", "do you want locations of rock art", "are you looking for information about cave painting in any location", "are you wondering what rock art is", "do you want pictures of rock art", "are you referring to a music genre", "do you want to buy rock art", "do you want to know how to perform rock art", "do you wnat to decorate with rock art", "are you going to purchase any specific tools", "do you want the history of rock art", "are you looking for examples of rock art", "are you trying to make art rock"], ["would you like to see articles about wedding budgeting", "are you looking for advice on wedding budgeting", "do you need this information for any specific part of your ceremony", "did you want to see examples of budget weddings", "would you like to find an app for wedding budgeting", "are you interested in a service for wedding budgeting", "what is your projected budget for your wedding", "were you interested in a free or paid budget calculator", "did you want to see if there was an app to do it", "did you want to see a wedding budget based on your income", "did you want something online that does calculations for you", "what are your budget priorities for your wedding", "what was the price range you were looking for"], ["are you looking for online promotions", "are you looking for merchandise catalog", "do you want find clothing stores", "would you like to know about the brooks brothers clearance return policy", "do you want to shop online for clothes", "are you trying to find brooks brothers clearance suits", "would you like a list of brooks brothers shoes on clearance", "are you looking to buy a suit", "do you want to know about brooks brothers clearance center in garland nc", "are you interested in brooks brothers clearance shirts", "would you like to learn about brooks brothers clearance sales", "do you need to find a brooks brothers location", "do you want information on sales and discounts", "are you looking for a brooks brothers outlet"], ["are you looking for events at churchill downs", "which part of churchill downs are you interested in knowing more about", "would you like to know the history of churchill downs", "are you looking for attractions near churchill downs", "are you wondering where churchill downs is", "do you want to know the best time to visit churchill downs is", "are you looking for directions to churchill downs", "are you looking for more information about churchill downs", "are you interested in a schedule of events from churchill downs", "do you want to know where churchill downs is located", "is there any specific race on your mind", "are you interested in the racing schedule"], ["would you like to do online shopping", "are you looking for a way to dispose your dog wast", "would you like to know what they are for", "are you lokking for a place to purchace dog clean uo bags", "do you want to know the cost", "how many dog lean up bags were you wanting to purchase", "which price listings would you like to know", "which online store eould you like to get the dog clean up bags from", "are you looking for the best to purchase", "do you want to know if they are a requirement where you live", "are you referring to a specif type of dog clean up bag", "are you looking for a seller near you", "are you interested in buying some", "are you looking for biodegradable dog clean up bags", "are you disposing of your dog waste at home or in a designated area", "would you like to know a location to find dog clean bags"], ["are you trying to build a pressure washer", "do you need a pressure washer shipped directly", "are you looking for the nearest location to buy a pressure washer", "do you want to price compare pressure washers", "are you wondering how a pressure washer works", "are you wondering what a pressure washer is", "do you wish to rent a pressure washer", "are you looking for a place to buy pressure washer parts", "are you looking to buy a pressure washer", "do you want a pressure washer with a certain engine", "are you looking to rent a pressure washer"], ["are you planning to take a trip on ontario or california", "do you need a map of the area would you like the website address", "would you like to book a flight at ontario california airport", "from which airport are you leaving", "would you like directions from your location", "do you need directions to ontario california airport", "are you interested in visiting ontario california airport", "do you mean an airport in canada", "would you like to know more about arrivals or departures", "would you like to hear nes about ontario california airport", "would you like to hear departure times for ontario california airport", "would you like to buy tickets to california", "would you like to book a hotel there", "do you need to make a booking are you travelling alone", "what ammendities are you looking for in your airport", "do you know how long your trip will be", "would you like to know more about ontarioca airport services", "is there anywhere in california youd like to go visit"], ["would you like the legal definition of diversity", "in what setting do you need to know more about diversity", "are you looking for educational materials about diversity", "are you looking into diversity in hiring", "what type of diversity do you need information about", "are you looking for a specific content related to diversity", "would you like to know how diversity helps or harms an organization", "are you looking for information on a specific diversity program", "is there a specific type of diversity statistic you are looking for", "do you need information on financial diversity", "are you looking for a definition of diversity", "would you like to see results about diversity in a business setting", "do you need the definition of diversity"], ["are you looking for a specific kind of truck", "do you want to know his most important discoveries", "do you want to go to euclid elementary", "are you interested in learning about the greek mathmetician", "what type of euclid information are you interested in", "do you want to know related people", "are you looking for a company", "do you want to know when he was alive", "do you want to see works of his", "do you need directions to euclid ave", "do you want a biography", "do you need more information about greek history"], ["do you need directions to the nearest starbucks", "which starbucks location do you need information for", "do you want to know how many locations starbucks has", "do you want to know how many types of coffee starbucks has", "do you want to see the starbucks menu", "are you looking for a recipe", "are you looking for a specific web page", "is there a specific starbucks product you need information on", "do you need contact information for starbucks", "would you like specific information about starbucks", "are you interested in the stocks of starbucks", "are you looking for current news related to starbucks", "would you like the location of the nearest starbucks", "would you like history information regarding starbucks", "are you looking for specific information about starbucks gift cards", "are you interested in a specific nutritional information"], ["do you want to see points of interest in hoboken", "are you looking for food in hoboken", "do you want information on the climate of hoboken", "are you looking for an apartment in hoboken", "would you like to know the history of hoboken", "are you looking for a specific web page", "are interested in the nightlife here", "do you want to know where hoboken is", "are you looking for information about the hoboken medical center", "do you want a hotel in hoboken", "do you want to visit hoboken", "do you want directions to hoboken", "are you looking for hoboken hotels"], ["are you wondering what pampered chef sells", "would you like to become a pampered chef consultant", "would you like to find pampered chef recipes", "are you wondering the prices of pampered chef", "would you like to find the nearest pampered chef consultant", "are you trying to buy pampered chef", "do you want to attend a pampered chef party", "would you like to host the show", "are you looking for reviews related to the pampered chef", "would you like to see the current pampered chef catalog", "are you wondering about pampered chef competitors", "are you wondering about the history of pampered chef"], ["are you looking for a specific type of solar panels", "would you like money saving ideas regarding solar panels", "are you looking for the cost of solar panels", "would you like the historical information on solar panels", "are you looking for information on purchasing and installing solar panels", "do you want annual savings totals if you install solar panels", "do you need information about different types of solar panels", "do you want to know where solar panels are typically installed in a home", "are you looking for specific information on solar power"], ["do you want to know what the best thing about living in india is", "would you like to know more about indian culture and history", "what is it like today living in india", "would you like to see a comparison of living in india versus living in the usa", "do you want to see pros and cons of living in india", "are you interested in buying a house in india", "would you like to learn about expats living in india", "are you interested in moving to india", "are you interested in the cost of living in india", "are you intested in statistics on expats residing in india", "would you like more information about the challenges of living in india", "do you want to know foreigners feelings about living in india", "what part of india are you interested in", "are you interested in the best place to live in india"], ["are you looking for information on the kiwi bird", "are you interested in images of the kiwi fruit", "would you like to know how to grow kiwi fruit", "are you looking for information on the fruit kiwi", "are you looking for kiwi birds for sale", "would you liketo know where kiwi fruit is grown", "do you want to know the historical background of the kiwi people", "do you want to know the nutritional aspects of the kii fuit", "would you like to know what the kiwi fruit tastes like", "are you referring to the fruit or the people from new zealand", "are you looking for kiwi fruit for sale near you", "are you interested in the biology of the kiwi bird"], ["would you like to find appraisers near you", "do you want to know the cost of an appraisal", "do you need a home appraisal", "what type of appraisals do you need informatiom about", "are you offering appraisal services", "do you need an antique apprasied", "what do you need appraised", "would you like to see the definitions of appraisal", "would you like to see a price range for appraisals", "are you looking for a type of appraiser", "what kind of appraisal are you looking for", "are you looking for appraisal companies near you"], ["which year archives are you looking for", "what information about the history of the paper are you interested in", "would you like to read about sports or news", "what type of articles would you like to read", "which reporters are you interested in reading articles from", "do you prefer long or short articles", "would you like the read the most recent article", "are you interested in a subscription to the milwaukee journal sentinel", "do you want an app for the sentinel", "are you looking for a specific web site", "which section of the paper do you want", "what kind of information are you seeking", "which medium do you prefer the newspaper to be in"], ["would you like to buy a book about this topic", "what amount of investment income are you using the capital gains tax rate for", "would you like to know how to avoid capital gains tax rate", "do you like to know capital gains tax on real estate", "what country are you looking at the capital gains tax rate for", "which of the capital gains tax rate are you interested in", "would you like a sample of capital gains worksheet", "do you want to know about short term or long term capital gains tax rate", "do you want a list of the most popular webster with answers to captain gains tax rate questions", "what capital gains tax rate year are you looking for", "do you like to know about shortterm capital gains tax rate 2020", "do you want a list of the current capital gains tax rates in a table"], ["during what time period of elvis presleys life", "are you interested in touring elvis presleys home", "are you looking into historical homes", "are you referring to the house elvis presley bought in 1956 or 1957", "are you looking to see how long elvis presley lived in his home", "do you like to know facts about elvis presley", "do you mean the home that elvis presley grew up in", "would you like the address for elvis presleys home", "do you want to know when elvis presleys home was built", "are you interested in visiting memphis tennessee", "are you referring to the name of elvis presleys house", "are you referring to elvis presleys hometown"], ["what other specifications do you want the recipe to have", "would you like a quick recipe", "do you want a one pot recipe", "how much time can you spend preparing the beef stroganoff", "would you like to cook the beef stroganoff in an instant pot or do you prefer an oven", "do you want the easiest recipe", "can you cook from scratch", "which ingredients do you want to include or exclude", "what would you like to make with the beef stroganoff", "do you care about reviews", "what is your favorite cut of beef to be used for the recipe", "who are your favorite chefs"], ["are you interested in seeing customer reviews of the ford edge", "what year is the ford edge that you are having problems with", "what city and state are you looking for a ford edge repair shop in", "what year ford edge are you inquiring about", "would you like to see a list of businesses near you that repair ford edges", "are you looking for the recalls on the ford edge", "do you want to see if there have been recalls of the ford edge", "what problems with the ford edge are you asking about transmission liftgate brakes etc", "how many miles does the ford edge with problems have on it", "are you having electrical mechanical or maintenance problems with your ford edge", "would you like to read reliability reports on the ford edge", "what size motor does the ford edge with problems have"], ["would you be interested in a timeline of events on orcas island", "do you want to know about the first inhabitants of orcas island", "do you want to know about the geographical history of the island", "would a video on the islands historical background be helpful", "are you looking for historical museums on orcas island", "are you interested in proeuropean history of orcas island", "what time period are you looking for information about", "are you interested in the natural history of orcas island", "do you want to know when orcas island was discovered", "are you looking for information from a specific era in the history of orcas island", "would you like to learn about the origin of the name of orcas island", "what kind of historical information are you looking to learn ex origin geography natural history etc"], ["would you like to see a reddit page on possible balding cures", "would you like to know about mens balding cures", "do you want balding cures for women", "are you looking for doctors that help with balding", "would you like to see a list of medical professionals who specialize in balding", "are you interested in seeing balding cure medications", "would you like to know the latest news about balding cures", "are you looking for quick balding cures", "are you interested in a balding cure for men or women", "do you want balding cure products", "are you interested in the latest balding cures available in 2020", "are you interested in a natural balding cure"], ["do you have a designated date and time you would want the hayride in pennsylvania", "how much would you like to spend on a hayride", "are you looking for free hayrides", "in what monh are you looking for hayrides", "are you interested in a haunted hayride in pennsylvania", "are you interested in a specific area in pennsylvania for hayrides", "what type of hayrides are you looking for", "do you want directions to a certain hayride in pennsylvania", "in what year are you looking for hayrides", "in what town in pennsylvania are you looking for hayrides", "what price range are you looking at for a hayride in pennsylvania", "would you be interested in a corn mae hayride in pennsylvania"], ["what is carotid cavernous fistula", "would you like to search for a doctor for a carotid cavernous fistula treatment", "what causes carotid cavernous fistula", "how long does it take to treat carotid cavernous fistula", "do you want to know more about carotid cavernous fistula treatment", "what are the symptoms of cavernous fistula", "do you want to know the cost of a carotid cavernous fistula treatment", "are you looking for a specific carotid cavernous fistula treatment", "how is a carotid cavernous fistula diagnosed"], ["what type of educational advantages are you seeking from social networking", "which social networking sites would you like information on", "do you want to know how you get education advantages from using social networking sites", "what level of schooling are you interested in gaining the advantages to social networking sites", "what ages do you want to know about education with social networking", "what education group are you referring to high school college or trade school", "are there any specific educational advantages you want to know more about while using social networking sites", "are you looking for career opportunities or educational learning online", "do you mean educational advantages in career placement or college referrals", "are you referring to facebook instagram linkedin or twitter regarding educational advantages", "do you mean peer social networking or professional social networking", "what kind of educational advantages would you like to understand while networking"], ["would you like to see a specific region of brazil", "would you like a book that has lots of maps of brazil", "would you like a transportation map of brazil", "would you like to know about brazil political jurisdictions boundaries", "which part of brazil do you need a map for", "are you planning a trip to brazil", "what are you trying to find in brazil", "do you want to know an app that has maps of brazil", "do you want a map of the roads in brazil", "what would you like to know about brazil", "do you need to know where to find a map of brazil", "are you searching for a map that shows the bodies of water in brazil", "would you like to know information about vacation in brazil", "what city are you looking for in brazil"], ["are you looking for templates to print out for poem in your pocket day", "do you need printable poems", "are you looking for activities for the day", "did you want the know what the reasoning for having poem in your pocket day is", "are you looking for examples of poems to carry for poem in your pocket day", "do you need information related to celebrating the poem in your pocket day", "did you want to know if there are activities for poem in your pocket day near you", "do you need to know the date for 2019", "are you interested in the canadian holiday", "are you searching in relation to the event in bryant park", "did you want to know when poem in your pocket day is"], ["do you want a state capitol map for the us", "are you referring to washington dc", "which part of the us capitol are you more interested in", "do you want to know what cities are on the us capitol map", "do you want a map of washington dc", "are you interested in a map of capitol hill", "do you want to know how to access a us capitol map", "do you want to know what details are on a us capitol map", "do you want to buy a map of the capitol of the us", "shall i order one for you", "would you like a map of every state capitol", "do you want to know if there is tour information on the us capitol map", "would you like historical information about us capitol maps"], ["are you looking for best treatments for angular cheilitis", "are you looking for webmd websites or mayo clinic websites about angular cheilits", "are asking what the symptoms are for angular cheilits", "are you looking for symptoms of angular cheilitis", "are you looking for the definition of angular cheilitis", "are you interested in home remedies for angular cheilitis", "have you been diagnosed with angular cheilitis", "are you interested in what can cause angular cheilitis", "are you looking for a common name for angular cheilitis", "would you like to know risks associated with angular cheilitis", "do you want to know how to avoid angular cheilitis", "are you looking for websites that describe angular cheilits"], ["would you like to visit a specific web page", "are you referring to the arcade game called defender", "are you playing soccer", "are you interested in video games related to defender", "are you referring to a vehicle", "are you interested in the television series defender", "are you looking for defender lyrics", "are you looking for a security system", "are you referring to a software", "are you wondering about soccer", "are you looking for advice on how to play soccer", "is your child playing soccer", "are you wondering about soccer gear", "are you interested in the isfj personality type"], ["do you like to know more about the 50 states on the us map", "would you like to know more about us geographic details", "would you be interested in all of the capitals of the map of the united states", "which language of us map would you prefer", "do you want to see a political map of the united states", "are you interested in a current map of the united states", "would you like to know where the us is located on the map", "are you interested in a historical map of the united states", "do you want to see a map of the continental united states", "are you interested in learning more about the us map", "are you looking for children coloring books", "are you interested in a satellite map of the united states", "are you interested in knowning the 50 states in the world", "would you like to know more about us roads", "do you want to see a map of united states territories", "are you looking for a paper version of us map"], ["do you need your horses hooves trimmed", "are you looking for information on the anatomy of horse hooves", "what problem is your horse having with their hooves", "do you want to know about how horse hooves are grown", "are you looking for information about horseshoe", "do you need horse hoof care tips", "are you asking about a horses feet", "are you looking for a diagram of a horse hoof", "do you want to inquire about horse hooves", "what would you like to know about horse hooves", "would you like to know about horse hooves diseases", "are you inquiring about the animals hooves", "do you want to know more about horse hooves", "do you want to know what horse hooves are made from"], ["which voyager are you interested in", "do you want to know more about star trek voyager", "do you want to know more about the nasa voyager program", "are you interested in where the voyager has been", "do you want to know where voyager is now", "are you looking for a specific web page", "are you referring to the voyager 1 or voyager 2", "would you like to know where the voyager is today", "do you want to know where to get a book on the voyager", "are you interested in the history of the voyager", "do you want to know more about the voyager mission", "are you referring to the space mission or anything else", "do you want to know which planets voyager has visited"], ["are you wondering if your memory is reliable", "do you want to improve your memory", "dio you want to know how memory is formed", "looking for shops that sell the board game memory", "are you looking for a specific store", "would you like to know how to increase your memory", "who was the first to study the brain and memory", "are you interested in the type of memories", "are you looking for famous people who have great memories", "are you looking for ways to naturally boost your memory", "are you interested in computer memory", "how to cheat at the game memory", "are you worried about memory loss"], ["do you want to know the prayer of that patron saint", "do you need to know if there is a patron saint for mental illness", "why are you interested in the patron saint of mental illness", "who you like to know who the patron saint of mental illness is", "would you like to know more about the patron saint of mental illness", "do you want to buy merchandise with the patron saint of mental illness on it", "do you want to know where the patron saint of mental illness was originated", "do you want to pray for someone with mental illness", "do you want to know all of the patron saints", "are you interested in learning the back story of the patron saint of mental illness", "do you want me to tell you who is the patron saint of mental illness", "do you want to see images of her"], ["would you like to buy a book about this topic", "are you looking for a specific time period for", "do you want to know when the first medical record was record", "would you like to know who invented the electronic medical record", "would you like to know when the electronic medical record became more widely used", "are you interested in a specific time when electronic medical record keeping started", "do you want to know how electronic medical record keeping began", "are you interested in learning about what was used before the electronic medical record was invented"], ["do you want to know which operating systems that work for raspberry pi", "would you like to see how it looks like", "do you like to know about raspberry pie", "are you referring to fruit or tech company", "do you want to know where raspberry pi is made", "what are the memory options available for raspberry pi", "would you like to know about raspberry pi os", "would you like to buy raspberry pi computer", "are you interested in the small single board computers or the pie", "do you like using computers", "would you like to know about raspberry pi camera", "when was raspberry pi created", "are you interested in raspberry pi projects", "did you know that there is a charity behind raspberry pi"], ["who is ombudsman of uss carl vilson", "would you like to know the home port of the uss carl vinson", "are you interested in who carl vinson was", "is uss carl vilson log available", "where can i read about uss carl vilson", "are you interested in the types of airplanes on the uss carl vinson", "are you interested in the uss carl vinsons dimensions", "would you like to know where the uss carl vinson is at right now", "would you like to see pictures of the uss carl vinson", "do you want to know when the uss carl vinson was commissioned into service", "are you interested in how the uss carl vinson got its name", "where is basis of uss carl vilson", "are you building a model of the uss carl vinson", "do you want to know about covid19 cases onboard the uss carl vinson"], ["are you interested in the current changes on the rules of golf", "are you interested in the basic rules of golf", "would you like to buy a book about the rules of golf", "which year are interested in", "are you interested in the updated 2020 rules of golf", "do you want to know how often the rules of golf changes", "are you looking for the official rules of golf", "do you want to know how many rules of golf there are", "are you referring to putter golf", "are you interested in the rules for equipment of golf", "are you interested in the most important rules of golf"], ["do you want to see some closeup of a turbine", "would you like to learn about wind power for homes", "are you interested in the benefits of wind power", "are you tring to locate facts about wind power", "are you looking for the definition of wind power", "are you interested in wind powered cars", "are you looking for companies in the wind power arena", "which are you interested in onshore or offshore wind power generation", "do you want to know the basics of wind power", "would you like to view the pros and cons of using wind power", "are you interested in the challenges of wind energy", "are you interested in news articles on wind power", "i have some photos of a wind farm want to see them", "do you want to know where in the world has the highest wind power potential", "want to know more about wind energy in the united states"], ["would you like to know the symptoms", "would you like to know about bhp treatment for dogs", "would you like to know if surgery is an option", "are you looking for a medication", "are you looking for doctor recommended remedies", "do you want to find an online forum about bhp treatment", "do you want to know facts about bhp treatment", "would you like to talk to a doctor about bhp treatment", "are you looking for a doctor that specializes in this", "are you looking for the bph treatment guidelines", "do you want to know what causes bph", "are you looking for home remedies", "are you interested in seeing the bhp treatment options", "do you need pain medication to accompany your bph treatment", "are you looking for a clinic that specializes in this", "are you interested in treatment side effects"], ["i assume you are referring to the 1965 film adaptation by david lean would you like to know which home media releases there are", "would you like to know more about the 1965 film", "would you like to schedule an appointment with dr zhivago", "would you like to know more about the russian civil war", "would you like to ask dr zhivago a question", "do you want to know the field o medicine doctor zhivago practices", "do you want to know if any theatres near you is playing the movie", "would you like to know about the cast of this movie", "do you want to know dr zhivago hours", "would you like to buy the novel of this title", "it was quite an interesting story behind writing the novel and getting it printed want to know more", "do you want to know which actor played doctor zhivago in the movie", "do you want to know if doctor zhivago is a real person", "do you need directions to visit dr zhivago", "do you want to make an appointment with doctor zhivago", "are you interested in boris pasternak", "do you want to read reviews about dr zhivago", "are you referring to the 1965 movie or the 2002 ministries", "are you referring to a different dr zhivago", "are you referring to the person", "did you know that its 1965 film adaptation got 5 oscars i can give you more details if you want", "are you referring to the movie or the book", "are you asking about the movie doctor zhivago", "do you want to know more about the 1957 novel", "do you want to know the summery of this movie", "would you like to know about the 2002 ministries", "are you referring to the 1957 novel or the 2011 musical"], ["are you looking to hire a land surveyor", "are you asking about land surveyors in the united states or another country", "are you interested in why they are needed", "do you want to know more about gear of land surveyor", "are you curious what a land surveyor does", "would you like to know how much hiring one costs", "are you trying to survey your own land", "are you thinking about a career as a land surveyor", "do you want to know how to become one", "is the education needed to become one what you are looking for", "are there famouss land surveyors", "what is the salary range of a land surveyor", "which type of land surveyor are you interested in"], ["are you interested in a specific golf gps system", "are you looking for golf ball sized gps technologies", "are you searching for the latest technologies involving golf", "would you like to buy a golf gps system", "are you interesting in tracking of golf balls on the course", "would you like to know how gps systems are used in golf", "would you like to know more about the legality of golf gps systems", "do you want to know if gps technology is restricted in some locations", "do you need overview of the most popular brands", "do you want to directions to the local golf retailer", "would you like a comparison of golf gps systems", "do you want to know how to use a smartphone for golf", "what is a formfactor of the device you are looking", "would you like to look up where you can get golf equipment", "are you looking to go to the nearest golf course", "are you interested in the history of gps systems in golf"], ["which home theater system are you interested in", "would you like to buy a home theater system", "are you looking to purchase a home theater system", "are you wanting to renovate your home in order to have a theater system", "do you want to know how much a system costs in terms of increased electronic bills", "what is your budget for a home theater system", "are you wanting to compare sizes of home theater systems", "are you searching for local companies to install a theater system", "are you looking to compare price points for theater systems", "would you like a list of stores that sell home theater systems", "are you looking for reviews of the home theater systems", "which are you looking to use the home theater system for"], ["are you looking for doctors that specialize in treating carpal tunnel syndrome", "are you looking for the medical billing code for this disorder", "would you like to know how to prevent carpal tunnel syndrome", "what to know how many people become healthy after the surgery", "are you interested in treatment or managment options", "do you like to know about carpal tunnel surgery", "would you like know about carpal tunnel syndrome", "are you looking for treatments for carpal tunnel syndrome", "do you want to know the symptoms of carpal tunnel syndrome", "would you like to know about carpal tunnel syndrome treatment", "are you looking for tests to diagnose carpal tunnel syndrome", "are you interested in the exercises for carpal tunnel", "do you need a list of who is at most risk of developing carpal tunnel syndrome", "are there any important related factors or complications you want to know about regarding carpal tunnel syndrome", "are you interested in learning more about the symptoms", "do you want to learn more about the risk factors", "would you like to know which activities are associated with the people diagnosed with the carpal tunnel syndrome", "are you searching for doctors that treat this condition", "are you looking for physicians in your area that specialize in carpal tunnel syndrome treatment", "are you interested in the causes", "would you like know about causes for carpal tunnel syndrome", "what kind of product for carpal tunnel syndrome are you looking for", "are you interested leaning about carpal tunnel syndrome symptoms", "are you interested in ways to relieve pain caused by carpal tunnel syndrome"], ["are you interested in fishing report from maryland department of natural resources", "do you want to know what jobs are available at the maryland department of natural resources", "would you like more information about the officials in the maryland department of natural resources", "would you like more information on the wildlife the maryland department of natural resources manages", "what information are you looking for regarding maryland department of natural resources", "are you interested in seasonal activities", "would you like to know the responsibilities of the maryland department of natural resources", "are you interested in news releases from maryland department of natural resources", "would you like to read news material and bulletins from the maryland department of natural resources", "are you interested in jobs available in maryland department of natural resources", "would you like to conact the maryland department of natural resources", "do you want to know the location of maryland department of natural resources", "do you want to know the conact number of maryland department of natural resources"], ["are you looking for a filmography of all of nicolas cages work", "would you like to see the top ten most popular nicolas cage movies", "quiz time which 2011 film featured nicolas cage", "are you interested in the nicolas cage movie for which cage won the best actor oscar", "would you like to see a list of nicolas cage movies", "would you like to know about a specific nicolas cage movie", "are you interested in reading the scripts for nicolas cage movies", "would you like to read reviews of nicolas cages latest movie", "is there a specific nicolas cage movie your interested in", "are you interested in a specific costar of a nicolas cage movie", "would you like to see details of the most recent nicolas cage movie", "want to know the next movie with him", "what would you like to know about nicolas cage movies", "i can give you a list of all movies he starred is that what you want", "do you want to watch some nicolas cage movies"], ["would you like to know the history of solar water fountains", "do you want to learn more about solar water fountains", "are you interested in how solar water fountains work", "are you interested in learning where to purchase solar water fountains", "are you looking for solar water fountain kits", "are you looking for the price of solar water fountains", "which price range of solar water fountains are you looking for", "do you want to know the benefits of solar water fountains", "what specific types of solar water fountains are you interested in", "would you like to understand better how solar water fountains work", "would you like to know how to build your own solar water fountain", "are you looking for a handyman who can install a solar water fountain"], ["is there a specific time period of nba records you are looking for", "do you want to know the holder of the nba career scoring record", "are you interested in nba records for this season or all of history", "can i iterate the available stats now", "interested in the records michal jordan holds", "are you looking for a site or chart", "are you interested in yesterdays or the seasons", "want to know who holds the record for most assists", "are the nba records for the division or game in its entirety", "want to know the nba alltime record holders", "what nba players are you interested in", "what nba records are you interested in", "are the records you seek for your hometown team", "are you interested in team or individual nba records", "which team or teams will you need this stats for", "is there a specific nba team whise records you would like to focus on"], ["would you like to know what age men may start male menopause", "are you interested in the differences between male and female menopause", "are you interested in male menopause medication", "would you like to see male menopause memes", "are you interested to see male menopause jokes", "do you want to know the symptoms of male menopause", "are you interested in description of the disease", "are you interested in male menopause symptoms", "why are you interested in learning more about male menopause", "would you like to know if male menopause is a real ailment", "would you like to know what age male menopause typically starts", "would you like to know what makes male menopause develop as a result of"], ["are you referring to a sports team that wears these colors on their uniform or logo", "are you looking for pittsburgh steelers merch", "are you looking for information on a type of jewelry manufactured in south dakota", "are you looking for purdue university sports", "are you interested in seeing art that features the colors black and gold", "are you looking for the color in combination", "do you need directions to the nearest black and gold store", "would you like to see a company with this name", "would you like to see images of objects that are black and gold", "do you want to know how black and gold have been used in products", "are you wanting to find black and gold logos", "are you referring to a song title", "do you want to look at anything that has a black and gold background", "are you interested in how the colors black and gold are formed in the color spectrum", "are you looking for objects that are black and gold"], ["do you want to know about festivals in the city", "would you like to view the traverse city newspaper", "would you like to see a list of things to do in traverse city", "what would you like to know about traverse city", "are you asking about traverse city in michigan", "are you looking for accommodations in traverse city", "are you interested in property", "are you trying to find directions to traverse city", "are you interested in making reservations at a restaurant in traverse city", "do you want directions to traverse city from your current location", "are you interested in purchasing traverse city whiskey", "do you want to know about the local government of traverse city", "would you like to check the weather for traverse city"], ["do you want to know which dogs have won the guinness world record title of tallest dog", "what are you interested in knowng about the life expectancy of larger dogs", "which time period would you like results for the worlds biggest dog", "what sort of maximum physical characteristic for dogs would you like to know about", "would you like to learn more about working with or owning larger breed dogs", "are you interested in learning more about health issues associated with larger breeds", "what would you like to know about the largest ever dog breeds", "did you want to know about a particular dog considered the biggest like zeus the great dane", "what would you like to know about zeus the largest dog in the whole world", "are you interested in which dog breed is considered the biggest", "would you like to see pictures of the biggest dogs", "would you like to know the largest breed or dog or the actual biggest dog"], ["are you interested in hair dye color shades", "are you seeking locations of beauty supplies in your area to make such purchase", "i can tell you how to make one yourself are you interested", "would you like to know what negative effects a hair dye can have in health", "do you need me to order you any available now", "do you need extra equipment when using hair dye", "are you interested in knowng how to use a hair dye properly", "would you like to know if there are any special considerations for expectant mothers", "are you interested in a particular hair dye or a history of hair dye", "are you interested in hair dye application or removal", "are you looking to dye your hair", "are you interested in a permanent or a rinse", "do you know what color of hair dye to use", "are you interested in hair dye color remover", "what hair dye brand will you use", "would you like to know about hair dye brands", "is the color to match your natural color or not", "are you interested in a list of hair dye brands", "i can show you locations where you can buy organic products do you want me to do it", "would you like a list of best hair dyes for type of hair", "do you want a specific brand", "what color of hair dye are you looking for", "what are the things that can go wrong when you dye your hair", "would you like to know about hair dye colors", "do you need numbers to retailers of this product", "do you need instructions on how to dye your hair"], ["do you need instructions on how to operate a ham radio", "would you the frequencies of various ham radio stations", "would you like to buy ham radio equipment", "would you like a history of the development of ham radio", "would you like to learn about the license classes", "would you like the physical locations of ham radio locations", "would you like to learn about the popularity of ham radio", "would you like tutorials on how to set up ham radio", "do you want to know how to get a license", "would you like to know a general description of ham radio", "do you want to know why its called ham radio", "there is a website of the ham radio outlet want to know the web address or swould i open it in your browser", "are you looking for a list of products", "would you like a list of videos about the subject", "want to know the call signs", "want to know which antennas ham radios use", "would you like a list of stores near you that sell ham radios"], ["are you interested in the reasons a lump in the throat occurs", "would you like to view sad movies or shows that give you a lump in your throat", "can thyroid problem cause a lump in the throat", "are you interested in learning more about how throat cancer lumps feel like", "are you referring to a song called lump in throat", "would you like to see foods that are commonly associated with this", "are you interested in seeing remedies for alleviating a lump in the throat", "would you like to conact a medical professional about this issue", "what type of medical information on lumps in the throat would you like", "would you like to know how long a lump in the throat occurs for", "would you like to know what causes a lump in the throat", "do you wish to see possible causes of a lump in throat", "would you like to know how to fix a lump in the throat"], ["are you trying to find uses for cannellini beans", "do you want to know if some people are allergic to cannellini beans", "would you like to know the nearest store to buy cannellini beans in your area", "do you want to know if any cannellini beans have ever been recalled", "do you want to know what plant produces cannelloni beans", "would you like to know where cannellini beans come from", "are you wondering how nutritious cannellini beans are", "are you looking for pasta dishes that can be made using cannellini beans", "do you want to know what company sells the most cannellini beans", "are you interested in where to buy cannellini beans", "are you interested in making soup with cannellini beans", "are you referring to cannellini bean recipes", "do you want to know an analog of cannellini beans"], ["would you like to know the origin of the afghanistan flag", "the flag has an emblem on it i can tell you what it symbolizes", "do you want to see what the afghanistan flag looks like", "are you interested in purchasing an afghanistan flag", "are you interested in the symbolism behind the afghanistan flags design", "which afghanistan flag are you interested in learning about the current one or a past version", "what would you like to know about the afghanistan flag", "would you like to know if the afghanistan flag has any symbols", "would you like to know if the afghanistan flag has changed over the years", "would you like to know the colors of the afghanistan flag"], ["which aspect of old town scottsdale are you interested in", "are you interested in downtown scottsdale or the historic core of the city", "are you interested in old town scottsdale", "do you want suggestions for things to do in old town scottsdale", "are you interested in learning about old town scottsdale", "are you interested in a map showing old town scottsdale", "would you like to know the location of old town scottsdale", "are you interested in the history of scottsdale", "would you like news about old town scottsdale", "would you like to know about old town scottsdale", "would you like directions on how to get to old town scottsdale", "do you want directions to old town scottsdale"], ["do you want information about the roosevelt island tramway", "would you like to see a map of roosevelt island", "what conent would you like about roosevelt island", "are you referring to roosevelt island in the division 2 video game", "would you like all conent included about roosevelt island", "would you like to visit roosevelt island", "would you like to know where roosevelt island is located", "would you like to know the geological location of roosevelt island", "are you interested in the history of roosevelt island", "are you referring to roosevelt island in new york or theodore roosevelt island in washington dc", "is there certain information you would like about roosevelt island"], ["would you like to know what other movies tom cruise or dustin hoffman play in", "are you looking for information on the cast and crew for rain man", "do you want to know who directed rain man", "do you want to know how much rain man made at the box office", "would you like to know when rain man was released in theatres", "are you interested in more movies from this genre", "would you like to learn more about autism", "would you like to know how you can watch the movie online", "can you tell me what interests you about this movie", "are you referring to the movie rain man", "do you want some quotes from the movie", "would you like a list of reviews for the film rain man", "are you looking for a lyrics of the rain main song", "would you like to learn about the real story that inspired the movie"], ["are you asking about the shelf life of refrigerated or unrefrigerated eggs", "will they be stored in a refrigerator", "would you like to know how long eggs last past their expiration", "will they be stored unrefridgerated", "where will you be storing them", "are you referring to uncooked eggs or an egg product", "do you want to know if expired eggs are safe to eat", "is it before or after the expiration date", "are you trying to remove rotten egg smell"], ["are you seeking a local occupational therapist", "do you want to find an occupational therapist", "would you like to see a list of nearby occupational therapist offices", "are you interested in finding out where occupational therapists work", "are you looking for an occupational therapist", "did you need to know about organizations for occupational therapists", "i looking for current positions", "what area do you need an occupational therapist in", "do you want to know how to become an occupational therapist", "do you want to know what an occupational therapist does", "would you like to hear the names of good occupational therapists", "would you like to learn about occupational therapy for children", "are you interested in the salary of an occupational therapist", "which occupational therapist are you looking for"], ["are you looking for home remedies for tooth pain", "are you looking for pictures of a tooth abscess", "do you want to know about tooth abscess symptoms", "would you like to learn about home remedies for treating a tooth abscess", "are you interested in the causes of tooth abscesses", "do you want to know about complications after the surgical removal", "are you looking for a dentist", "are you looking for academic articles about tooth abscesses", "do you want to know how a tooth abscess is treated", "do you want to see a selfquiz to determine if you have a tooth abscess", "would you like to know the symptoms of a tooth abscess", "do you you want to know what happen if no actions would be taken"], ["would you like to get information about getting diagnosed with barretts esophagus", "would you like to see a picture of barretts esophagus", "do you want to learn more about the risk factors for barretts esophagus", "are you interested in the definition or the symptoms and causes", "would you like to know what is a suitable feet for someone who has barrets esophagus", "do you want to know if barretts esophagus is serious", "would you like to see any papers that reference barretts esophagus", "would you like to hear about treatments", "would you like to hear about related conditions to barretts esophagus", "would you like to know about the symptoms", "would you like to know about symptoms causes and treatments", "would you like to know about the risks associated with barrets esophagus", "would you like to speak to an expert about barretts esophagus", "do you want to know what barrets esophagus is", "would you like to know about gastrooesophageal reflux disease", "do you want to know about treatments", "are you interested in which institutions deal with this medical condition", "want to hear about related mayo clinic research", "are you interested in signs you may have barretts esophagus", "would you like to see barretts esophagus references in the news", "would you like to know about the symptoms of barretts esophagus", "would you like to know what the causes are", "would you like to know where to get treatment"], ["would you like to find out more about the origin of the name teddy bear", "would you like to know how to assemble a teddy bear", "are you looking to buy a teddy bear for a child or an adult", "are you interested in teddy bear clipart or cartoons", "can you tell me if there is a brand of teddy bears that you are interested in", "are you interested in books about teddy bears", "what is the specific occasion you are looking to buy a teddy bear for", "would you like to know about fictional teddy bears", "would you like to know when was the first teddy bear invented or who made it", "for what age is the teddy bear for", "are you interested in a personalized teddy bear", "what is your favorite style of teddy bears custommade or mass production", "i can show you information on bulk orders is it something that you might be interested in", "there are some really big ones want to know more", "do you want to know where to buy teddy bears", "are you interested in the history of teddy bears", "which specific retail business you would like information on that sells teddy bears", "are you interested in a particular manufacturer of teddy bears", "what history details of teddy bears would you like to know", "gund an american company founded in 1898 is making such toys want to see some pictures", "do you want to know about the history of teddy bears", "are you interested in which teddy bears are the most expensive in the world", "are you looking for general information about teddy bears and are you looking to buy a teddy bear", "would you like to know more about the cultural impact of teddy bears", "are you interested in purchasing a ted bear", "would you like to buy a personalized teddy bear or a teddy bear for a specific occasion", "which size of teddy bear do you prefer small medium or large"], ["do you want to know the differences between the novel and the movie", "do you want the print or audiobook version", "would you like to know the reading level of the novel", "are you looking for a downloadable version", "would you like more information on the book or the author", "do you want movie reviews", "did you want to know what ages it is appropriate for", "are you interested in the plot of the story or when ti was written", "are you interested in a summery of the book before buying it", "do you want to know about the heroes of the book", "would you like to know other books written by louis sachar", "would you like to see reviews by professionals or by readers", "are you interested in purchasing the book", "are you interested in the movie or the novel", "i can find a lesson plan for a class related to it would you be interested"], ["are you interested in what hip roofs are made of such as metal or asphalt", "would you like to know how to frame a hip roof", "want to learn about trusses for such a roof", "which type of hip roof design are you interested in", "are you interested in learning how to calculate materials for a hip roof", "would you like to know the different designs of hip roofs", "do you want to know the common features of hip roofs", "would you like to see how a hip roof looks like", "are you interested in learning how to construct a hip roof", "are you interested in more than one hip roof design", "would you like to know what the most common architecture style uses hip roofs", "do you want to know the advantages and disadvantages of hip roofs", "would you like to compare a hip roof to another style", "do you want to know where hip roofs are popular"], ["do you want to know the benefit of carpenterter bee", "what the best ways to kill carpenterter bee", "how can i identify carpenterter bee", "does carpenterter bee make a nest", "what kind of sound carpenterter bees make", "would you like to know if carpenterter bees skincare dangerous", "are you interested in the difference between carpenterter bee and other bees", "are you looking for ways to get rid of carpenterter bee", "do you need to know how to get rid of carpenterter bees", "do you want to know more about carpenterter bees sting", "how does carpenterter bee look like", "what information do you want to know about carpenterter bee", "how harmful are carpenterter bees", "are you looking for signs to identify if carpenterter bees are present", "do you want to know if carpenterter bees are harmful", "would you like to know how to protect wood from carpenterter bees", "are you simply seeking general information about carpenterter bees", "are you looking to compare a carpenterter bee to a bumblebee"], ["what geographic region of the american revolution are you interested in", "do you want to see a gallery depicting its events", "what event of the revolution do you want to know more about", "did you mean the american revolution", "would you like to know who fought in the american revolution", "do you want to buy a book on this topic", "are you looking for revolutionary war videos", "what battle of the american revolution are you interested in", "which american revolution battles are you interested in", "which viewpoint of the american revolutionary are you interested in", "what time frame of the american revolutionary are you interested in", "which area of the american revolution are you interested in", "would you like to know how the war ended", "do you want a timeline of this topic", "do you want the american revolutionary war a specific person or a specific army", "would you like me to tell you why the american revolution began", "are you asking about the revolutionary war", "would you like to know the main events of the war", "what revolutionary general would you like to know about", "do you want a list of war battles", "are you asking about the battles in the american revolution", "do you want a definition from wikipedia", "would you like to know the causes of the revolution", "would you like to know the years of the american revolution"], ["who is the maker of f5 tornado", "where tornado can happen", "what are the features of f5 tornado", "what is the average speed of f5 tornado", "show videos of f5 tornado", "are you interested in other categories of tornadoes", "would like to know about where f5 tornadoes have struck", "how much damage can f5 tornado take", "which tornados were the most devastating", "what is f5 tornados top speed", "do you want to know how fast an f5 tornados speed is", "how to locate tornado shelters", "would you like to know the size of an f5 tornado", "how many victims f5 tornado caused", "which famouss f5 tornado are you interested in learning more about", "would you like to see what damage can be caused by an f5 tornado"], ["are you looking for a translation of the lyrics", "would you like a lyric video", "what version of the song are you interested in", "do you want the text or a video", "do you want the lyrics and song on the same page", "what language do you want the lyrics in", "do you want the entire set of lyrics of the song or the chorus", "are you looking for lyrics and chords to play"], ["are you asking for the mental benefits of running or physical", "which types of benefits are you interested in with regard to running", "are you wanting to know benefits of running vs walking", "are you referring to running long distances", "do you want to find out about running away", "are you asking about health benefits", "what type of benefits are you searching for health or physique", "would you like to know the benefits of running in the cold vs running inside", "do you want to inquire about the benefits of running in regards to living longer", "are you interested how long you swould be running for weight loss", "would you be seeking information about running for an office"], ["where you looking for the bus schedule and prices", "what state are you searching for marshall county schools", "where you looking for reopening dates from closures due to the corona virus", "which state would you like to find out about in regards to marshall county schools", "would you like to find out more about enrollment in the schools", "would you like to learn about the curriculum in the marshall county schools", "would like to know a list of marshall county schools in your state", "where you looking for the school lunch menu", "what time period are you referring to search on the schools in marshall county", "do you want to learn more about the demographics in the schools", "are you searching for an address for the schools", "where you looking for employment opportunities", "who do you want to speak with the superintendent or a principal"], ["what areas of sun tzus life are you most interested in knowng more about", "would like to know the story behind sun tzu", "are you interested in a specific aspect of his life", "are you interested in learning more about sun tzus art of war", "would you like to read a book he wrote", "want to see some examples of his philosophy", "would you like to known tzus philosophies on war", "are you interested in books written about sun tzu", "would you like to buy the book the art of war", "are you more interested in how art of war philosophy applies to your daily life", "would you like to see quotes by sun tzu", "do you want to know more about sun tzus life", "are you more interested in anecdotal aspects of his life", "would you like to know more about his life", "would you like to know if hes chinese of japanese", "are you interested in sun tzus family", "would you like to know the century he was born", "are you more interested in how to apply sun tzu philosophy to a business", "which aspects of sun tzus role in chinese history are you interested in", "are you asking about sun tzu in rise of kingdoms", "which of sun tzus writings are you interested in", "are you referring to the author of the art of war"], ["are you looking for halloween movie to watch with the middle school kids", "are you looking for foodie halloween activities for middle school", "would you like to see fun halloween science activities for middle school", "are you interested in printable for middle school kids", "are you interested in middle school halloween activities worksheets", "are you looking for indoor or outdoor halloween activities for middle school", "what halloween icon do you like the best", "are you halloween activities for a middle school teacher or a student", "are you looking for halloween crafts for the middle school kids", "what kind of school subject are you interested in making the halloween activities for", "what theme of halloween are you looking for"], ["do you what to know about interpretation of decease in dreams", "are you interested in dreams interpretations involving snakes", "are you looking for dreams interpretations regarding the bible", "do you want interpretation of running down", "are you interested in meaning of dreams involving insects", "are you interested in a book about dream interpretations", "do you want to know common ways to explain dreams", "do you want to know what dreams mean", "are you interested in dreams interpretations dealing with water", "would you like an app on dreams interpretation", "do you want information about dreams interpretations about teeth falling out", "are your dreams of varying modes of color"], ["would you like to know the definition of wilsons disease", "are you interested in learning when this disease was discovered", "do you want information on the treatment of wilsons disease", "what wilsons disease medication are you wanting to know more about", "what areas of wilsons disease are you most interested in learning about", "what would you like to know about wilsons disease", "would you like to know about potential cures for wilsons disease", "what do you need to know about wilsons disease", "would you like to hear about treatments for this disease", "would you like to know the typical treatment for wilsons disease", "what medications do you take for wilsons disease", "do you want to know what kind of feet is good for conrolling symptoms of wilsons disease", "what can i tell you about wilsons disease", "are you interested int he prognosis of thise diagnosed with wilsons disease", "what symptom of wilsons disease would you like to know more about", "do you want to know the symptoms of wilsons disease", "would you like to know if there is a special feet for people with this condition", "do you want to see what wilsons disease does to the eyes", "do you want to see pictures of what wilsons disease looks like", "do you want to look at life expectancy for this illness", "do you want to know who it is named after", "are you looking for the symptoms of this disease"], ["are you looking for holiday classes", "are you interested in group or solo lessons", "whats your price range", "are you interested in miniature golf or standard golf", "how close swould the instructor be to your home", "are you looking for information to help you improve your golf technique", "are you trying to find a golf instructor near you", "how many hours a week do you want to take golf lessons", "are you trying to find out how to become a golf instructor", "about how many years experience do you want the instructor to have", "do you want to find out how much a golf instructor charges", "do you want to know about educational materials for different levels of experience", "do you want to find online golf tutorials", "what level of experience swould the gold classes target"], ["do you want to know about the bombing of the uss cole", "what do you want to know about the uss cole", "are you interested about uss coles service history", "would you like to know where the uss cole is", "do you want to see a picture of the uss cole", "do you want the death toll from the uss cole", "what time period would you like to know about in reference to the uss cole", "are you interested where the uss cole is today", "is there an event you want to know about regarding the uss cole", "would you like to know about the 2000 uss cole bombing", "would you like to know how many deaths occured in the uss cole bombing", "would you like to know how the uss cole was repaired", "do you want to know the history behind the uss cole", "do you want to know how many people were killed in the uss cole bombing", "would you like to know the classification of the uss cole", "would you like to know the history of the uss cole", "would you like to know how the uss cole was named", "would you like to know about awards the uss cole has won", "are you interested in learning more of the uss cole bombing", "do you like to know about the commander of the uss cole", "would you like to know about the investigation of the uss cole bombing", "would you like to know the rescue efforts for the uss cole", "are you interested in the history of the uss cole", "would you like to know who bombed the uss cole"], ["would you like to search museums about african american music history", "are you interested in how african american music influenced american culture", "are you interested in visiting the national museum of african american music", "are you looking for an essay or book about this topic", "would you like to hear about significant figures in african american music", "would you like to learn more about how african american music influenced other genres of music", "are you interested in a specific time period like rap music or the harlem renaissance", "are you interested in the music brought and made by slaves", "do you want to know about specific african american musicians", "which time period of african american music history are you interested in", "do you want to know how jaz influenced the world"], ["would you like to know what the cast of bewitched looks like now", "there is a movie bewitched is this the cast you seek", "do you wish to hear about the rumoured curse of the bewitched cast", "would you like the cast with the first darren or the second darren", "are you interested in knowng the estimated net worth of the bewitched cast", "are you interested in knowng which cast members of bewitched are still alive", "would you like the earliest cast or all the people that acted in bewitched to the present date", "would you like the movie bewitched or the tv show cast", "would you like the names of the original bewitched cast members", "would you like the original bewitched cast", "when is the time period of the bewitched cast you would like to know", "would you like to know where the cast of bewitched are now"], ["do you want to know what years mister rogers aired on television", "are you interested in the recently released movie about mister rogers", "i can tell you about his purple panda are you interested", "are you interested in the documentary made about mister rogers", "are you interested in watching clips of mister rogers neighborhood", "are you looking for information on the tv show mister rogers or the movie about him", "would you like some mister rogers quotes", "are you interested in the mister rogers movie", "do you need to know information about mister rogers", "would you like to know where you can watch the tv show mister rogers", "would you like a list of quotes by mister rogers", "would you like to see mister rogers biography", "would you like to know about the television show mister rogers neighborhood", "are you inquiring about mister rogers the show or mister rogers the television personality", "would you like to know about mister rogers family", "are you interested in the details of mister rogers life", "are you referring to fred rogers", "are you looking for a biography of fred rogers", "what would you like to know about mister rogers", "are you interested in mister rogers television show", "are you interested in fred rogers", "are you interested in the character of fred rogers or the person who portrayed him on tv", "which mister rogers are you interested in"], ["are you asking about a specific theorist", "do you want to know about a specific application of game theory", "do you want to read about it", "would you like to know the history of game theory", "game theory is an active theory of science would you like to learn about current research events or perhaps you want to attend a class on it", "what type of game theory do you want to know about", "are you interested in videos about game theory", "what form of media do you prefer to learn about game theory in", "are you looking for the definition of game theory"], ["do you want to know what ketones are", "would you like to try some ketogenic feet recipes", "do you want to know how to lose weight", "would you like to know which foods to stay away from on a ketogenic feet", "are you interested in the benefits of a ketogenic feet", "are you interested in reading ketogenic feet reviews", "do you want to learn more about the foods you swould eat", "do you want more information on low carb feets", "which foods are you concerned about whether you can or cannot eat on a ketogenic feet", "do you want to know how to start the feet", "do you want to know what foods you swould avoid while on this feet", "do you need to read the rules of a ketogenic feet", "do you want to know about potential health problems associated with it"], ["are you wanting to know who headed up the missions", "do you want to know dates for the missions", "do you want to know which planets have been reached by nasa technology", "do you want to know who was involved in the missions", "are you interested in the history of these missions", "are you referring to past missions", "are you wondering about which spacecraft have reached other planets", "do you want to know about future missions", "are you interested in movie with interplanetary missions", "do you want to understand the science of space travel", "are you wondering about nasas plans for future travel", "do you want to know how often nasa tries to travel to other planets"], ["are you interested in tips for including more magnesium rich foods into your daily feet", "would you like to learn about symptoms of magnesium deficiency", "do you want to find recipes to learn how to make magnesium rich foods", "would you like to know about magnesium rich foods that are kid friendly", "do you want to look at foods besides fruits and vegetables that are high in magnesium", "do you have any interest in learning why you swould be consuming magnesium rich foods", "want to learn what other minerals are in foods that are high in magnesium", "would you like to learn the drawbacks to consuming magnesium rich foods", "would you like to see a list of these foods", "are you interested in some recipes for these foods"], ["are you seeking information about the former prime minister of cuba", "did you want to research on fidel castro administration", "do you need to know what fidel castro did for cuba", "are ozzie guillen and fidel castro related", "what would you like to know about fidel alejandro castro ruz", "what specifically do you need to know about fidel castro", "did you want to know how cuba was under fidel castro", "do you need facts about the history of cuba", "had fidel castro have a family", "are you interested in what fidel castro did for cuba", "what facts did you want to know about fidel castro", "who is fidel castro", "are you interested in learning about historical dictators", "are you wanting to read about fidel castro biography"], ["would you like to know how the benefits of yoga are related to time of day", "which of the benefits of yoga are you interested in", "would you like to know about its benefit for a pregnant woman", "are you interested in benefits of yoga classes", "do you like to know benefits of yoga in the morning", "what types of benefits of yoga would you like to know about", "are you referring to benefits of yoga essay", "do you like to know yoga benefits that are supported by science", "are you interested in videos listing the benefits of yoga", "which kind of yoga routine are you looking to learn the benefits of", "are you interested in mental benefits of yoga", "would you like to know about the benefits of yoga for a specific group men women kids athletes", "did you want to know the health benefits of yoga that have been scientifically proven", "are you interested in a specific pose"], ["are you looking for some pictures", "are you asking about a man named norway spruce", "do you want results for the country norway", "are you interested in the tree by the name of norway spruce", "is this the name of someone you are looking for", "would you like to find about the ways of identifying the tree", "are you planning to grow the tree", "are you talking about a plant by the name of norway spruce", "would you like to know about its diseases", "what about norway spruce are you looking for"], ["do you need directions to sangre de cristo mountains", "would you like to see a map of sangre de cristo mountains", "would you like information on camping in the sangre de cristo mountains", "are you interested in finding lodging at sangre de cristo mountains", "are you interested in winter activities", "do you want to know more about recreational activities", "would you like to know the weather at sangre de cristo mountains", "are you interested in real estate near the sangre de cristo mountains", "are you planning on travelling to sangre de cristo mountains", "why are you interested in sangre de cristo mountains", "do you want to see photos of the sangre de cristo mountains", "do you want to know about the geology of the san de cristo mountains", "are you interested in a map of the sangre de cristo mountains"], ["do you want to know about distinctive features of a flowering plant", "do you want to know how some of them are called", "what color flowers are you interested in", "what time of year would you like the flowers for", "would you like to know how many flowing plants there are", "how much time would you like to spend on maintaining the plant", "are you interested in flowers of a certain region", "how big would you like your flowering plants to get", "are you interested in flowers of a certain season", "do you what to know about evolution", "do you you want to know how they look like", "how much gardening do you want with your flowering plant", "do you have a color preference of the flower", "how much aroma would you like your plant have", "are there any specific flowers you would like to know about", "are you interested in insolation"], ["are you looking for the symptoms", "do you need to know what causes it", "do you want to know what it is", "do you want to know how to avoid it", "are you looking for treatments", "are you interested in at what height you can get altitude sicknes", "what aspects of altitude sickness are you looking for information on", "are you looking for altitude sickness remedies", "do you want to know chances to have altitude sickness in specific locations", "do you want to know how to cure it", "do you want to know the symptoms of altitude sickness", "would you like to know how to reverse altitude sickness", "are you wondering what elevation is at risk", "do you want information on deaths associated with altitude sickness"], ["would you like to know about emergency treatment of jehovahs witnesses", "would you like to know more about the health care provided to jehovahs witnesses", "are you interested in health care specifically for jehovahs witnesses", "would you like to learn if jehovahs witnesses accept medical treatment", "would you like to learn more about jehovahs witnesses beliefs on health care", "are you interested in jehovahs witnesses and blood transfusions", "are you wanting to hear more about jehovahs witnesses denying healthcare", "are you interested in the medical ethics of treating jehovahs witnesses", "are you wanting to know more about jehovahs witnesses and blood transfusions", "did you want to know about whether or not jehovahs witnesses believe in healthcare", "would you like to know about the clinical strategies for medical care of jehovahs witnesses", "are you interested in learning about the challenges of treating jehovahs witnesses"], ["would you like to learn about the issues surrounding pink slime in ground beef", "do you want to know if there is an establishment that serves this", "do you want to see images of it", "do you want to know what a pink slime actually is", "do you want to know what pink slime in ground beef is made of", "do you want to know if pink slime used at school canteens", "would you like to see the usda guidelines regarding pink slime in ground beef", "would you like to see news reports regarding pink slime in ground beef", "are you looking for companies that use this as an ingredient", "are you searching for possible health effects of this product", "are you wondering if mcdonalds has pink slime in their ground beef", "would you be interested to know if the uk has pink slime in their ground beef", "do you want to know if a specific product has it as an ingredient", "are you interested in the video about pink slime in ground beef", "are you referring to the mcdonalds pink slime", "do you want to know what ammonia is used for in pink slime", "would you like to know if there are pink slime in ground beef lawsuits", "do you want the history of this product", "do you want to know the health concerns of pink slime in ground beef", "would you like to see videos on how its made", "do you want to see pictures of the pink slime from mcdonalds", "are you interested in research studies regarding pink slime in ground beef"], ["would you like to know the definition of the word mean", "are you interested in calculating a mean value", "are you trying to calculate a mean absolute deviation", "are you trying to find the average number", "are you trying to find a calculator specifically to find a mean", "would you like to know the difference between mean median and mode", "what would you like to find the mean of", "would you like to see how to calculate a mean formula", "would you like to know how to calculate mean in excel"]], "clarification_need": ["2", "2", "2", "1", "2", "2", "2", "2", "2", "2", "2", "2", "1", "2", "3", "3", "2", "3", "3", "2", "3", "2", "2", "4", "2", "2", "3", "4", "3", "1", "2", "2", "4", "3", "2", "2", "2", "1", "2", "4", "3", "3", "3", "2", "3", "2", "3", "3", "2", "3", "1", "3", "2", "2", "2", "3", "1", "4", "3", "3", "1", "1", "2", "1", "3", "2", "3", "2", "2", "2", "2", "3", "3", "2", "2", "2", "3", "2", "3", "3", "3", "2", "3", "3", "3", "3", "2", "2", "3", "4", "2", "4", "3", "2", "4", "1", "2", "3", "1", "2", "4", "4", "4", "3", "1", "2", "4", "3", "4", "4", "3", "2", "4", "3", "3", "4", "3", "3", "2", "2", "4", "4", "4", "2", "3", "3", "2", "3", "2", "1", "1", "1", "2", "3", "1", "2", "1", "1", "4", "2", "2", "1", "1", "1", "2", "1", "2", "3", "3", "3", "2", "2", "3", "2", "3", "2", "4", "3", "2", "2", "4", "2", "2", "3", "3", "4", "3", "3", "2", "2", "4", "2", "3", "3", "3", "3", "3", "3", "2", "4", "4", "2", "1", "2", "3", "1", "1", "2", "3", "3", "2", "3", "2", "2", "2", "2", "4", "3", "3", "4", "4", "2", "2", "2", "3", "2", "3", "4", "4", "3", "3", "3", "2", "3", "3", "4", "3", "1", "1", "1", "2", "2", "2", "2", "2", "2", "3", "2", "2", "3", "4", "2", "2", "4", "4", "1", "3", "3", "2", "2", "3", "2", "2", "3", "3", "2", "2", "2", "1", "2", "2", "2", "4", "3", "3", "3", "1", "2", "3", "2", "3", "3", "2", "1", "2", "2", "3", "4", "2", "2", "3", "2", "2", "1", "2", "4", "2", "1", "3", "2", "2", "2", "2", "4", "3", "3", "2", "1", "1", "3", "1", "2", "3", "2", "2", "2", "2", "3"]}